using System;
using UnityEngine;

// Token: 0x0200002F RID: 47
public class Lang
{
	// Token: 0x0600018F RID: 399 RVA: 0x0001A7B8 File Offset: 0x000189B8
	public static void Init()
	{
		if (PlayerPrefs.HasKey(CONST.MD5("DefLanguage")))
		{
			Lang.current = PlayerPrefs.GetInt(CONST.MD5("DefLanguage"));
		}
		else
		{
			if (PlayerProfile.network == NETWORK.FB || PlayerProfile.network == NETWORK.IO || PlayerProfile.network == NETWORK.KG || PlayerProfile.network == NETWORK.KR || PlayerProfile.network == NETWORK.ST)
			{
				Lang.current = 1;
			}
			else
			{
				Lang.current = 0;
			}
			PlayerPrefs.SetInt(CONST.MD5("DefLanguage"), Lang.current);
			PlayerPrefs.Save();
		}
		Lang.txt[0] = new string[1000];
		Lang.txt[1] = new string[1000];
		Lang.txt[0][0] = "Создать клан";
		Lang.txt[0][1] = "У вас есть удаленный клан";
		Lang.txt[0][2] = "Восстановить клан";
		Lang.txt[0][3] = "или присоединяйся к существущему клану";
		Lang.txt[0][4] = "Найти клан";
		Lang.txt[0][5] = "Название клана";
		Lang.txt[0][6] = "Создание клана доступно с 10 уровня или для премиумов игроков";
		Lang.txt[0][7] = "Вы не делали заявок в клан";
		Lang.txt[0][8] = "Для поиска клана, необходимо отменить заявку";
		Lang.txt[0][9] = "Клан ненайден";
		Lang.txt[0][10] = "Клан";
		Lang.txt[0][11] = "Уровень";
		Lang.txt[0][12] = "Глава";
		Lang.txt[0][13] = "Слоты";
		Lang.txt[0][14] = "Опыт";
		Lang.txt[0][15] = "Прогресс уровня";
		Lang.txt[0][16] = "Глава клана";
		Lang.txt[0][17] = "Размер клана";
		Lang.txt[0][18] = "Дата создания";
		Lang.txt[0][19] = "Расформировать клан";
		Lang.txt[0][20] = "Покинуть клан";
		Lang.txt[0][21] = "Управление составом";
		Lang.txt[0][22] = "Управление заявками";
		Lang.txt[0][23] = "Скидка увеличивается при каждой покупке!";
		Lang.txt[0][24] = "Информация";
		Lang.txt[0][25] = "Загрузка профиля";
		Lang.txt[0][26] = "Спасибо что запустили игру, получите бонус 20 м.!";
		Lang.txt[0][27] = "Бонус";
		Lang.txt[0][28] = "Настройки сохранены";
		Lang.txt[0][29] = "Скорость мышки";
		Lang.txt[0][30] = "Динамический свет";
		Lang.txt[0][31] = "Разрешение экрана";
		Lang.txt[0][32] = "Дальность прорисовки";
		Lang.txt[0][33] = "Введите пароль для подключения к ";
		Lang.txt[0][34] = "Отмена";
		Lang.txt[0][35] = "Подключиться";
		Lang.txt[0][36] = "Неверный пароль!";
		Lang.txt[0][37] = "Имя";
		Lang.txt[0][38] = "Фраги";
		Lang.txt[0][39] = "Смерти";
		Lang.txt[0][40] = "ПРЕМИУМ";
		Lang.txt[0][41] = "Премиум:\nДвойной опыт в игре, двойное количество блоков\nОружие на срок действия: АК47, СВД, гранаты\nСрок действия: 7 дней";
		Lang.txt[0][42] = "СООБЩИТЬ СОЮЗНИКАМ";
		Lang.txt[0][43] = "Вы получили бонус за уровень ";
		Lang.txt[0][44] = "ОБЩИЕ";
		Lang.txt[0][45] = "ПРИВАТ";
		Lang.txt[0][46] = "Режимы";
		Lang.txt[0][47] = "Все режимы";
		Lang.txt[0][48] = "Битва";
		Lang.txt[0][49] = "Стройка";
		Lang.txt[0][50] = "Зомби";
		Lang.txt[0][51] = "Захват";
		Lang.txt[0][52] = "Контра";
		Lang.txt[0][53] = "Резня";
		Lang.txt[0][54] = "Выживание";
		Lang.txt[0][55] = "Фильтр";
		Lang.txt[0][56] = "Все сервера";
		Lang.txt[0][57] = "Доступные";
		Lang.txt[0][58] = "Вы забанены за использование читов";
		Lang.txt[0][59] = "Стройка доступна во вкладке Приват";
		Lang.txt[0][60] = "Доступ для игроков 20 уровня";
		Lang.txt[0][61] = "Создать сервер";
		Lang.txt[0][62] = "Создавать сервер\n\nмогут Премиум игроки";
		Lang.txt[0][63] = "Граната";
		Lang.txt[0][64] = "Шмель";
		Lang.txt[0][65] = "Динамит";
		Lang.txt[0][66] = "Количество 200 штук\nБросок кнопка G\n";
		Lang.txt[0][67] = "Количество 50 штук\nВыбор кнопка Q\n";
		Lang.txt[0][68] = "Топор";
		Lang.txt[0][69] = "Нож";
		Lang.txt[0][70] = "Бита";
		Lang.txt[0][71] = "Лом";
		Lang.txt[0][72] = "Оружие ближнего боя";
		Lang.txt[0][73] = "Защита";
		Lang.txt[0][74] = "Каска";
		Lang.txt[0][75] = "Броня";
		Lang.txt[0][76] = "Арктик";
		Lang.txt[0][77] = "1337";
		Lang.txt[0][78] = "Солдат";
		Lang.txt[0][79] = "Райдер";
		Lang.txt[0][80] = "Подрывник";
		Lang.txt[0][81] = "Повстанец";
		Lang.txt[0][82] = "Террор";
		Lang.txt[0][83] = "Пилот";
		Lang.txt[0][84] = "Снайпер";
		Lang.txt[0][85] = "SAS";
		Lang.txt[0][86] = "Спецназ";
		Lang.txt[0][87] = "USMC";
		Lang.txt[0][88] = "Выживший";
		Lang.txt[0][89] = "Бандит";
		Lang.txt[0][90] = "Ветеран";
		Lang.txt[0][91] = "Сталкер";
		Lang.txt[0][92] = "Призрак";
		Lang.txt[0][93] = "Десант";
		Lang.txt[0][94] = "Наемник";
		Lang.txt[0][95] = "Визуальный скин наемника\nСрок действия: неограничен";
		Lang.txt[0][96] = "Аптечка S";
		Lang.txt[0][97] = "Восстанавливает 25hp жизней\nТребуемый уровень 1\nКоличество 200 штук";
		Lang.txt[0][98] = "Аптечка M";
		Lang.txt[0][99] = "Восстанавливает 50hp жизней\nТребуемый уровень 13\nКоличество 200 штук";
		Lang.txt[0][100] = "Аптечка L";
		Lang.txt[0][101] = "Восстанавливает 100hp жизней\nТребуемый уровень 21\nКоличество 200 штук";
		Lang.txt[0][102] = "Клан +8";
		Lang.txt[0][103] = "Расширение клана на +8 человек";
		Lang.txt[0][104] = "Карты";
		Lang.txt[0][105] = "Слот";
		Lang.txt[0][106] = "Дополнительный слот для карт";
		Lang.txt[0][107] = "Спасибо за покупку!";
		Lang.txt[0][108] = "У вас уже есть данный предмет.";
		Lang.txt[0][109] = "Недостаточный уровень.";
		Lang.txt[0][110] = "урон";
		Lang.txt[0][111] = "темп";
		Lang.txt[0][112] = "обойма";
		Lang.txt[0][113] = "запас";
		Lang.txt[0][114] = "дальность";
		Lang.txt[0][115] = "Вы получили 10 монет!";
		Lang.txt[0][116] = "Админ Меню";
		Lang.txt[0][117] = "Режим игры";
		Lang.txt[0][118] = "ID карты";
		Lang.txt[0][119] = "Загрузить";
		Lang.txt[0][120] = "Пароль на сервер";
		Lang.txt[0][121] = "Поставить";
		Lang.txt[0][122] = "Сбросить";
		Lang.txt[0][123] = "Закрыть";
		Lang.txt[0][124] = "Кикнуть";
		Lang.txt[0][125] = "Доступ";
		Lang.txt[0][126] = "Команде";
		Lang.txt[0][127] = "Всем";
		Lang.txt[0][128] = "ВЫБОР ОРУЖИЯ";
		Lang.txt[0][129] = "Мои карты";
		Lang.txt[0][130] = "Применить размер";
		Lang.txt[0][131] = "x ширина: ";
		Lang.txt[0][132] = "y высота: ";
		Lang.txt[0][133] = "z длина: ";
		Lang.txt[0][134] = "ПРИГОТОВЬТЕСЬ К БОЮ";
		Lang.txt[0][135] = "ЗАРАЖЕНИЕ НАЧАЛОСЬ";
		Lang.txt[0][136] = "ЛЮДИ ОДЕРЖАЛИ ПОБЕДУ";
		Lang.txt[0][137] = "ЗОМБИ ЗАХВАТИЛИ МИР";
		Lang.txt[0][138] = "НА ЭТОТ РАЗ НИЧЬЯ";
		Lang.txt[0][139] = "на весь экран";
		Lang.txt[0][140] = "отключить чат";
		Lang.txt[0][141] = "включить чат";
		Lang.txt[0][142] = "выйти в меню";
		Lang.txt[0][143] = "Карта#";
		Lang.txt[0][144] = "Настроить размер";
		Lang.txt[0][145] = "Сохранить изменения";
		Lang.txt[0][146] = "Команда синие";
		Lang.txt[0][147] = "команда красные";
		Lang.txt[0][148] = "Команда зеленые";
		Lang.txt[0][149] = "Команда желтые";
		Lang.txt[0][150] = "Люди";
		Lang.txt[0][151] = "Соединение";
		Lang.txt[0][152] = "Загрузка";
		Lang.txt[0][153] = "СТАРТ ИГРЫ ЧЕРЕЗ";
		Lang.txt[0][154] = "ЗОМБИ АТАКУЮТ (ВОЛНА ";
		Lang.txt[0][155] = "СЛЕДУЮЩАЯ ВОЛНА ЧЕРЕЗ 30 СЕКУНД!";
		Lang.txt[0][156] = "Дождитесь окончания раунда!";
		Lang.txt[0][157] = "Ожидайте появления!";
		Lang.txt[0][158] = "Выберите команду!";
		Lang.txt[0][159] = " кикнул ";
		Lang.txt[0][160] = "запретил";
		Lang.txt[0][161] = "разрешил";
		Lang.txt[0][162] = " сохранил карту";
		Lang.txt[0][163] = " установил пароль ";
		Lang.txt[0][164] = " сбросил пароль";
		Lang.txt[0][165] = "Карамель";
		Lang.txt[0][166] = "Лопата";
		Lang.txt[0][167] = "Набор тайлов";
		Lang.txt[0][168] = "низкая";
		Lang.txt[0][169] = "средняя";
		Lang.txt[0][170] = "высокая";
		Lang.txt[0][171] = "Сохранить";
		Lang.txt[0][172] = "Ожидание подтверждения...";
		Lang.txt[0][173] = "Оружие";
		Lang.txt[0][174] = "Техника";
		Lang.txt[0][175] = "Снаряжение";
		Lang.txt[0][176] = "Скины";
		Lang.txt[0][177] = "Остальное";
		Lang.txt[0][178] = "Вы отказались от покупки";
		Lang.txt[0][179] = "ОШИБКА! Что-то пошло не так...";
		Lang.txt[0][180] = "КУПИТЬ";
		Lang.txt[0][181] = "Штурмовик";
		Lang.txt[0][182] = "Поддержка";
		Lang.txt[0][183] = "Пистолеты";
		Lang.txt[0][184] = "Скины персонажа";
		Lang.txt[0][185] = "Скины техники";
		Lang.txt[0][186] = "прочность";
		Lang.txt[0][187] = "броня";
		Lang.txt[0][188] = "скорость";
		Lang.txt[0][189] = "перезарядка";
		Lang.txt[0][190] = "наведение";
		Lang.txt[0][191] = "Танки";
		Lang.txt[0][192] = "Оборудование для танков";
		Lang.txt[0][193] = "Боеприпасы";
		Lang.txt[0][194] = "Медицина";
		Lang.txt[0][195] = "Боеприпасы для танков";
		Lang.txt[0][196] = "Кланы";
		Lang.txt[0][197] = "Выберите оружие для улучшения";
		Lang.txt[0][198] = "Выберите технику для улучшения";
		Lang.txt[0][199] = "нажмите на нужный вам параметр чтобы улучшить оружие";
		Lang.txt[0][200] = "нажмите на нужный вам параметр чтобы улучшить технику";
		Lang.txt[0][201] = "Модули";
		Lang.txt[0][202] = "Вы не состоите в клане";
		Lang.txt[0][203] = "Ваша текущая заявка в клан - ";
		Lang.txt[0][204] = "КЛАН ";
		Lang.txt[0][205] = "СОСТАВ";
		Lang.txt[0][206] = "ПРОРЫВ";
		Lang.txt[0][207] = "ЗАЧИСТКА";
		Lang.txt[0][208] = "ТАНКИ";
		Lang.txt[0][209] = "ЗАГРУЖЕНО ";
		Lang.txt[0][210] = " ИЗ ";
		Lang.txt[0][211] = " РЕСУРСОВ";
		Lang.txt[0][212] = "ОЖИДАНИЕ АВТОРИЗАЦИИ";
		Lang.txt[0][213] = "ОЖИДАНИЕ ЗАГРУЗКИ";
		Lang.txt[0][214] = "Загрузка";
		Lang.txt[0][215] = "Загрузка главной темы";
		Lang.txt[0][216] = "Загрузка скинов";
		Lang.txt[0][217] = "Загрузка текстур";
		Lang.txt[0][218] = "Загрузка звуков";
		Lang.txt[0][219] = "Загрузка моделей";
		Lang.txt[0][220] = "Загрузка шрифтов";
		Lang.txt[0][221] = "ПОСЛЕДНЯЯ КОНФИГУРАЦИЯ";
		Lang.txt[0][222] = "СЕСТЬ В ТАНК";
		Lang.txt[0][223] = "ЛЮК ЗАКРЫТ";
		Lang.txt[0][224] = "Информация:";
		Lang.txt[0][225] = "Каска разово защищает от попадания в голову";
		Lang.txt[0][226] = "Броня частично защищает от попаданий пуль";
		Lang.txt[0][227] = " доступ ";
		Lang.txt[0][228] = "ПРОДОЛЖИТЬ";
		Lang.txt[0][229] = "РАССКАЗАТЬ";
		Lang.txt[0][230] = "Поздравляем Боец!\nВы получили 30 монет!\nОстальные подарки\nуже в инвентаре.";
		Lang.txt[0][231] = "Мачете";
		Lang.txt[0][232] = "Служит для ремонта/поломки техники";
		Lang.txt[0][233] = "Гаечный ключ";
		Lang.txt[0][234] = "Миномет";
		Lang.txt[0][235] = "Гранатомет";
		Lang.txt[0][236] = "В качестве боеприпасов\nиспользуются гранаты GP\n";
		Lang.txt[0][237] = "Джавелин";
		Lang.txt[0][238] = "Противотанковый ракетный комплекс\nВ качестве боеприпасов\nиспользуются самонаводящиеся ракеты\nКоличество 25 штук";
		Lang.txt[0][239] = "Граната GP";
		Lang.txt[0][240] = "Количество 30 штук\nТолько для оружия:\n";
		Lang.txt[0][241] = "Количество 25 штук\nВыбор кнопка Q\n";
		Lang.txt[0][242] = "Эффективен против техники";
		Lang.txt[0][243] = "РПГ-7";
		Lang.txt[0][244] = "Разово защищает от попадания в голову\n";
		Lang.txt[0][245] = "Защищает от попадания в торс\n";
		Lang.txt[0][246] = "Срок действия: неограничен";
		Lang.txt[0][247] = "Визуальный скин ";
		Lang.txt[0][248] = "Беглец";
		Lang.txt[0][249] = "КОП";
		Lang.txt[0][250] = "Наемница";
		Lang.txt[0][251] = "Киллер";
		Lang.txt[0][252] = "Стандарт";
		Lang.txt[0][253] = "Стандартный скин";
		Lang.txt[0][254] = "Слендер";
		Lang.txt[0][255] = "Фредди";
		Lang.txt[0][256] = "Джейсон";
		Lang.txt[0][257] = "Хранитель";
		Lang.txt[0][258] = "Зомби мальчик";
		Lang.txt[0][259] = "Зомби девочка";
		Lang.txt[0][260] = "для легкого танка";
		Lang.txt[0][261] = "для среднего танка";
		Lang.txt[0][262] = "для тяжелого танка";
		Lang.txt[0][263] = "Пустынный ";
		Lang.txt[0][264] = "Чешуя ";
		Lang.txt[0][265] = "Мультикам ";
		Lang.txt[0][266] = "Тигровый ";
		Lang.txt[0][267] = "Деревянный ";
		Lang.txt[0][268] = "ЛТ";
		Lang.txt[0][269] = "СТ";
		Lang.txt[0][270] = "ТТ";
		Lang.txt[0][271] = "Блокадовец";
		Lang.txt[0][272] = "Советский солдат";
		Lang.txt[0][273] = "Германский офицер";
		Lang.txt[0][274] = "Режим";
		Lang.txt[0][275] = "Режим контра для приват серверов";
		Lang.txt[0][276] = "Подарок";
		Lang.txt[0][277] = "Подарок от Администрации\nОткрывать в инвентаре";
		Lang.txt[0][278] = "при движении игрока - стрельба недоступна";
		Lang.txt[0][279] = "оружие обладает вариативным уроном";
		Lang.txt[0][280] = "увеличенная скорость перезарядки";
		Lang.txt[0][281] = "увеличены урон, бронебойность, магазин";
		Lang.txt[0][282] = "Количество 50 шт.\n";
		Lang.txt[0][283] = "ЗБК18М";
		Lang.txt[0][284] = "Кумулятивные снаряды для танков\n";
		Lang.txt[0][285] = "ЗОФ26";
		Lang.txt[0][286] = "Осколочно-фугасные снаряды для танков\n";
		Lang.txt[0][287] = "Эффективны против техники\n";
		Lang.txt[0][288] = "Эффективны против пехоты\n";
		Lang.txt[0][289] = "Выбор кнопка Q";
		Lang.txt[0][290] = "Ремкомплект";
		Lang.txt[0][291] = "Применение кнопка 5";
		Lang.txt[0][292] = "Полностью восстанавливает\nпрочность танка\n";
		Lang.txt[0][293] = "КПВТ";
		Lang.txt[0][294] = "Крупнокалиберный\nпулемет Владимирова танковый\n";
		Lang.txt[0][295] = "модуль не\nустановлен";
		Lang.txt[0][296] = "д";
		Lang.txt[0][297] = "ч";
		Lang.txt[0][298] = "м";
		Lang.txt[0][299] = "с";
		Lang.txt[0][300] = "Доступен в режиме танки\n";
		Lang.txt[0][301] = "Легкий танк";
		Lang.txt[0][302] = "Средний танк";
		Lang.txt[0][303] = "Тяжелый танк";
		Lang.txt[0][304] = " секунд";
		Lang.txt[0][305] = " секунда";
		Lang.txt[0][306] = " секунды";
		Lang.txt[0][307] = "Раунд начнется через ";
		Lang.txt[0][308] = "Этаж ";
		Lang.txt[0][309] = "10 секунд до эвакуации с этажа!\n Пожалуйста, зайдите в лифт.";
		Lang.txt[0][310] = "Взрыв произойдет через 30 секунд.";
		Lang.txt[0][311] = "Этаж зачищен!\n60 секунд, чтобы покинуть этаж.";
		Lang.txt[0][312] = "Поражение!!!\nВы погибли!";
		Lang.txt[0][313] = "Поздравляем!!!\nВы победили!";
		Lang.txt[0][314] = "Покиньте шахту лифта!!!\nУ Вас 10 секунд!";
		Lang.txt[0][315] = "ДИНАМИТ ЗАЛОЖЕН!\nДО ВЗРЫВА 10 СЕКУНД!";
		Lang.txt[0][316] = "ПЕРЕЗАПУСК ЧЕРЕЗ 5 СЕКУНД!";
		Lang.txt[0][317] = "ПРОРЫВ НАЧНЕТСЯ ЧЕРЕЗ ";
		Lang.txt[0][318] = "ПРОРЫВ НАЧАЛСЯ!";
		Lang.txt[0][319] = "ПЕРВЫЙ РУБЕЖ ПРОРВАН!";
		Lang.txt[0][320] = "ПРОРЫВ ЗАВЕРШЕН! КОМАНДА СИНИЕ ОДЕРЖАЛА ПОБЕДУ!";
		Lang.txt[0][321] = "ВРЕМЯ ВЫШЛО! КОМАНДА КРАСНЫЕ ОТБИЛА АТАКУ!";
		Lang.txt[0][322] = "КОМАНДА СИНИЕ БЕЖАЛА С ПОЛЯ БОЯ!\nКОМАНДА КРАСНЫЕ ОТБИЛА АТАКУ!";
		Lang.txt[0][323] = "КОМАНДА КРАСНЫЕ БЕЖАЛА С ПОЛЯ БОЯ!\nКОМАНДА СИНИЕ ОДЕРЖАЛА ПОБЕДУ!";
		Lang.txt[0][324] = "ОЖИДАНИЕ ДРУГИХ ИГРОКОВ!";
		Lang.txt[0][325] = "ДО ПРИБЫТИЯ ПОДКРЕПЛЕНИЯ КРАСНЫМ ОСТАЛОСЬ 30 СЕКУНД!";
		Lang.txt[0][326] = "ДО ПРИБЫТИЯ ПОДКРЕПЛЕНИЯ КРАСНЫМ ОСТАЛОСЬ 20 СЕКУНД!";
		Lang.txt[0][327] = "ДО ПРИБЫТИЯ ПОДКРЕПЛЕНИЯ КРАСНЫМ ОСТАЛОСЬ 10 СЕКУНД!";
		Lang.txt[0][328] = " из 3 динамитов заложен!";
		Lang.txt[0][329] = " до возрождения...";
		Lang.txt[0][330] = "ИЗМЕНЕНИЯ ПРИМЕНЯТСЯ ПРИ\nСЛЕДУЮЩЕМ ВОЗРОЖДЕНИИ";
		Lang.txt[0][331] = "Вызов техники будет доступен через ";
		Lang.txt[0][332] = "ИГРОКИ";
		Lang.txt[0][333] = "КЛАНЫ";
		Lang.txt[0][338] = "\nТребуемый уровень 6";
		Lang.txt[0][339] = "\nТребуемый уровень 13";
		Lang.txt[0][340] = "\nТребуемый уровень 21";
		Lang.txt[0][341] = "ТРЕБУЕМЫЙ\nУРОВЕНЬ ";
		Lang.txt[0][342] = "РОССИЯ";
		Lang.txt[0][343] = "ЕВРОПА";
		Lang.txt[0][344] = "США";
		Lang.txt[0][345] = "ПОЗДРАВЛЯЕМ С ПОЛУЧЕНИЕМ\n";
		Lang.txt[0][346] = " УРОВНЯ!\nВАШ БОНУС:";
		Lang.txt[0][347] = "НОВЫЙ УРОВЕНЬ";
		Lang.txt[0][348] = "Режим Битва. Удерживайте центр чтобы зарабатывать очки.";
		Lang.txt[0][349] = "Режим Битва. Очки зарабатываются только если одна команда\nнаходится в центре.";
		Lang.txt[0][350] = "Режим Зомби. Не стойте близко к окнам - зомби могут\nдотянуться до вас!";
		Lang.txt[0][351] = "Режим Зомби. Играя за людей помните - держась группами\nвыжить легче чем по-одиночке.";
		Lang.txt[0][352] = "Режим Захват. Для победы нужно набрать 5000 очков.";
		Lang.txt[0][353] = "Режим Захват. Территории на которых возрождаются команды\nзахватить нельзя.";
		Lang.txt[0][354] = "Режим Захват. Раз в две секунды вы получаете одно очко\nза одну захваченную территорию.";
		Lang.txt[0][355] = "Режим Контра. Смерти не влияют на счет матча.\nУмирайте сколько хотите!";
		Lang.txt[0][356] = "Режим Контра. Убер-технология разрушения карт\nне работает в этом режиме.";
		Lang.txt[0][357] = "Режим Резня. Битой можно вывести врага из строя\nс одного удара, но ее скорость замаха выше остальных оружий.";
		Lang.txt[0][358] = "Режим Резня. Иногда бить в тело выгоднее чем в голову,\nособенно если у врага есть каска.";
		Lang.txt[0][359] = "Режим Выживание. Пользуйтесь тем, что npc-зомби не умеют прыгать.\nПока что.";
		Lang.txt[0][360] = "Режим Выживание. Опять же, держитесь группами.";
		Lang.txt[0][361] = "Режим Танки. Будьте осторожны! Горящие танки вскоре взорвутся.";
		Lang.txt[0][362] = "Режим Танки. Кумулятивный снаряды танка \"ЗБК18М\" эффективны против танков,\nв то время как фугасные \"ЗОВ26\" - против пехоты.";
		Lang.txt[0][363] = "Полный экран";
		Lang.txt[0][364] = "Белсникель";
		Lang.txt[0][365] = "Кролик мальчик";
		Lang.txt[0][366] = "Кролик девочка";
		Lang.txt[0][367] = "Зимний ";
		Lang.txt[0][368] = "Зомби издание";
		Lang.txt[0][369] = "ВЕСЕЛОГО ХЭЛЛОУИНА!";
		Lang.txt[0][370] = "ВЕСЕЛОГО ХЭЛЛОУИНА!\nВАШ ПОДАРОК ";
		Lang.txt[0][371] = " МОНЕТ!\nПОЗДРАВЛЯЕМ!";
		Lang.txt[0][372] = "Дважды защищает от попадания в голову\n";
		Lang.txt[0][373] = "Укрепленный шлем";
		Lang.txt[0][374] = "Укрепленная броня";
		Lang.txt[0][375] = "Эльф";
		Lang.txt[0][376] = "Снеговик";
		Lang.txt[0][377] = "Снегурочка";
		Lang.txt[0][378] = "Дед мороз";
		Lang.txt[0][379] = "Поздравляем Боец!\nВы получили 30 монет!!\nОстальные подарки\nуже в инвентаре.";
		Lang.txt[0][380] = "ПОЗДРАВЛЯЕМ!";
		Lang.txt[0][381] = "ПРЕДЗАКАЗ";
		Lang.txt[0][382] = "ВОЗРОЖДЕНИЕ ЧЕРЕЗ ";
		Lang.txt[0][383] = " СЕКУНД";
		Lang.txt[0][384] = "ВАШ ID";
		Lang.txt[0][385] = "ТЕХНИЧЕСКИЕ РАБОТЫ";
		Lang.txt[0][386] = "ПРОВОДЯТСЯ ТЕХНИЧЕСКИЕ\nРАБОТЫ.\nПОЖАЛУЙСТА,\nЗАЙДИТЕ ПОЗЖЕ.";
		Lang.txt[0][387] = "БАН!";
		Lang.txt[0][388] = "ВЫ БЫЛИ ЗАБАНЕНЫ!";
		Lang.txt[0][389] = "ВЫХОД";
		Lang.txt[0][390] = "ОШИБКА!";
		Lang.txt[0][391] = "ПРОИЗОШЛА ОШИБКА\nПРИ ПОПЫТКЕ\nАВТОРИЗАЦИИ!\nПОЖАЛУЙСТА,\nЗАЙДИТЕ ПОЗЖЕ.";
		Lang.txt[0][392] = "Анархист";
		Lang.txt[0][393] = "Мятежник";
		Lang.txt[0][394] = "Пехотинец";
		Lang.txt[0][395] = "Солдат ВМФ";
		Lang.txt[0][396] = "Солдат ВВС";
		Lang.txt[0][397] = "Ручная фугасная граната.\n";
		Lang.txt[0][398] = "Ручная дымовая граната.\n";
		Lang.txt[0][399] = "Ручная кумулятивная граната.\n";
		Lang.txt[0][400] = "СИНИЕ";
		Lang.txt[0][401] = "КРАСНЫЕ";
		Lang.txt[0][402] = "ЗЕЛЕНЫЕ";
		Lang.txt[0][403] = "ЖЕЛТЫЕ";
		Lang.txt[0][404] = "ВЫБОР КОМАНДЫ";
		Lang.txt[0][405] = "СПИСОК КОМАНД";
		Lang.txt[0][406] = "ЛЮДИ";
		Lang.txt[0][407] = "МЕРТВЫ";
		Lang.txt[0][408] = "ЗОМБИ";
		Lang.txt[0][409] = "АВТО";
		Lang.txt[0][410] = "ХОЛОДНОЕ";
		Lang.txt[0][411] = "ПЕРВИЧНОЕ";
		Lang.txt[0][412] = "ВТОРИЧНОЕ";
		Lang.txt[0][413] = "АММУНИЦИЯ";
		Lang.txt[0][414] = "ТЕХНИКА";
		Lang.txt[0][415] = "УРОН";
		Lang.txt[0][416] = "ТЕМП";
		Lang.txt[0][417] = "ОБОЙМА";
		Lang.txt[0][418] = "ЗАПАС";
		Lang.txt[0][419] = "ДАЛЬНОСТЬ";
		Lang.txt[0][420] = "ПРОЧНОСТЬ";
		Lang.txt[0][421] = "БРОНЯ";
		Lang.txt[0][422] = "СКОРОСТЬ";
		Lang.txt[0][423] = "ПЕРЕЗАРЯДКА";
		Lang.txt[0][424] = "НАВЕДЕНИЕ";
		Lang.txt[0][425] = "СНАЙПЕР";
		Lang.txt[0][426] = "ШТУРМОВИК";
		Lang.txt[0][427] = "ПОДДЕРЖКА";
		Lang.txt[0][428] = "АРСЕНАЛ";
		Lang.txt[0][429] = "В БОЙ";
		Lang.txt[0][430] = "ПЕХОТА";
		Lang.txt[0][431] = "ВЗРЫВЧАТКА";
		Lang.txt[0][432] = "ТЕХНИКА";
		Lang.txt[0][433] = "ГРАНАТЫ";
		Lang.txt[0][434] = "ТАНКИ";
		Lang.txt[0][435] = "ОПИСАНИЕ";
		Lang.txt[0][436] = "Каспер";
		Lang.txt[0][437] = "Джек";
		Lang.txt[0][438] = "Оборонительное снаряжение,\nзащищающее от пуль";
		Lang.txt[0][439] = "Журналистка";
		Lang.txt[0][440] = "Мулатка";
		Lang.txt[0][441] = "Девочка-ассасин";
		Lang.txt[0][442] = "Террористка";
		Lang.txt[0][443] = "ОБНОВЛЕНИЕ\nСПИСКА СЕРВЕРОВ\nЧЕРЕЗ ";
		Lang.txt[0][444] = "Для покупки требуется танк!";
		Lang.txt[0][445] = "РАЗБАН $";
		Lang.txt[0][446] = "У Вас нет клана!";
		Lang.txt[0][447] = "Достигнут лимит участников клана!";
		Lang.txt[0][448] = "Значки";
		Lang.txt[0][449] = "Токсик";
		Lang.txt[0][450] = "Британский солдат";
		Lang.txt[0][451] = "Французский солдат";
		Lang.txt[0][452] = "Японский солдат";
		Lang.txt[0][453] = "Солдат США";
		Lang.txt[0][454] = "ВОВ 70 лет";
		Lang.txt[0][455] = "Георгиевская лента";
		Lang.txt[0][456] = "Флаг Британии";
		Lang.txt[0][457] = "Флаг Франции";
		Lang.txt[0][458] = "Флаг Германии";
		Lang.txt[0][459] = "Флаг Японии";
		Lang.txt[0][460] = "Флаг России";
		Lang.txt[0][461] = "Флаг США";
		Lang.txt[0][462] = "Флаг СССР";
		Lang.txt[0][463] = "Нагрудный знак ";
		Lang.txt[0][464] = "Защита от газовых гранат\n";
		Lang.txt[0][465] = "ПТ МИНА\n";
		Lang.txt[0][466] = "КОКТЕЙЛЬ МОЛОТОВА\n";
		Lang.txt[0][467] = "М202\n";
		Lang.txt[0][468] = "ГАЗОВАЯ ГРАНАТА\n";
		Lang.txt[0][469] = "БРОНИРОВАННЫЙ БЛОК\n";
		Lang.txt[0][470] = "Вспышка\n";
		Lang.txt[0][471] = "Дым\n";
		Lang.txt[0][472] = "(временно недоступно)";
		Lang.txt[0][473] = "Количество 1000 шт\n";
		Lang.txt[0][474] = "Заменяет стандартный блок\n";
		Lang.txt[0][475] = "Количество 25 шт\n";
		Lang.txt[0][476] = "Бросок кнопка H\n";
		Lang.txt[0][477] = "Джип\n";
		Lang.txt[0][478] = "СЕСТЬ В ДЖИП";
		Lang.txt[0][479] = "ВЫЗОВ ТЕХНИКИ НЕДОСТУПЕН,\nПОКА ДЖИП ЗАНЯТ ДРУГИМИ ИГРОКАМИ!";
		Lang.txt[0][480] = "ДРУЗЬЯ";
		Lang.txt[0][481] = "МЕСТО";
		Lang.txt[0][482] = "ИМЯ В VK";
		Lang.txt[0][483] = "УРОВЕНЬ";
		Lang.txt[0][484] = "ЗАГРУЗКА РЕЙТИНГА СРЕДИ ДРУЗЕЙ...";
		Lang.txt[0][485] = "ОШИБКА ЗАГРУЗКИ РЕЙТИНГА СРЕДИ ДРУЗЕЙ.";
		Lang.txt[0][486] = "С ДРУГОМ";
		Lang.txt[0][487] = "ЗАГРУЗКА СПИСКА ДРУЗЕЙ...";
		Lang.txt[0][488] = "МЕГАПАКИ";
		Lang.txt[0][489] = "УНИКАЛЬНОЕ ПРЕДЛОЖЕНИЕ!\nВсе виды вооружения и техники\nв одном паке со скидкой\nболее 70%!";
		Lang.txt[0][490] = ": АВТОРИЗАЦИЯ";
		Lang.txt[0][491] = ": ЗАГРУЗКА КАРТЫ";
		Lang.txt[0][492] = ": ПОСТРОЕНИЕ КАРТЫ";
		Lang.txt[0][493] = ": ВИЗУАЛИЗАЦИЯ КАРТЫ";
		Lang.txt[0][494] = ": ЗАГРУЗКА ПРОФИЛЯ";
		Lang.txt[0][495] = "Только для танков,\nкупленных в магазине\n";
		Lang.txt[0][496] = "Можно снять установив стандартный скин.\n";
		Lang.txt[0][497] = "\nЗАХВАТИТЕ ВСЕ ФЛАГИ ПРОТИВНИКА!\n";
		Lang.txt[0][498] = "\nЗАЩИЩАЙТЕ ФЛАГИ ЛЮБОЙ ЦЕНОЙ!\n";
		Lang.txt[0][499] = "ВСЕ ФЛАГИ ЗАХВАЧЕНЫ!";
		Lang.txt[0][500] = "\nПРОТИВНИК ОТБРОШЕН НА ПОСЛЕДНИЙ РУБЕЖ!\nДОБЕРИТЕСЬ ДО ТОЧКИ ЭВАКУАЦИИ!";
		Lang.txt[0][501] = "\nНЕ ДАЙТЕ ПРОТИВНИКУ ДОБРАТЬСЯ ДО ТОЧКИ ЭВАКУАЦИИ!";
		Lang.txt[0][502] = " из 4 флагов захвачен!";
		Lang.txt[0][503] = " из 50 солдат эвакуирован!";
		Lang.txt[0][504] = "Список";
		Lang.txt[0][505] = "КАРТЫ БИТВА";
		Lang.txt[0][506] = "КАРТЫ КОНТРА";
		Lang.txt[0][507] = "Первая карта в подарок!";
		Lang.txt[0][508] = "Достигнут лимит карт!";
		Lang.txt[0][509] = "Поздравляем Боец!\nВы получили 30 монет!!\nОстальные подарки\nуже в инвентаре.";
		Lang.txt[0][567] = "и скин ";
		Lang.txt[0][568] = "!!\nОстальные подарки\nуже в инвентаре.";
		Lang.txt[0][510] = "ВЕСЕЛОГО ХЭЛЛОУИНА!";
		Lang.txt[0][511] = "Дракула";
		Lang.txt[0][512] = "Мумия";
		Lang.txt[0][513] = "Оборотень";
		Lang.txt[0][514] = "АКЦИЯ ПРОДЛИТСЯ ДО ~";
		Lang.txt[0][515] = "ТОЧКА ПРИЦЕЛА";
		Lang.txt[0][516] = "ТИП ПРИЦЕЛА";
		Lang.txt[0][517] = "ЦВЕТ ПРИЦЕЛА";
		Lang.txt[0][518] = "Алиса";
		Lang.txt[0][519] = "Флаг Украины";
		Lang.txt[0][520] = "Флаг Белоруссии";
		Lang.txt[0][521] = "ШАПКИ";
		Lang.txt[0][522] = "МАСКИ";
		Lang.txt[0][523] = "Визуальное украшение";
		Lang.txt[0][524] = "БЛИЖНИЙ БОЙ";
		Lang.txt[0][525] = "ПИСТОЛЕТЫ";
		Lang.txt[0][526] = "Сапер";
		Lang.txt[0][527] = "Блокада 3 года";
		Lang.txt[0][528] = "Блокада 6 лет!";
		Lang.txt[0][529] = "НАЖМИТЕ ЛЕВУЮ КНОПКУ МЫШИ ДЛЯ ВОЗРОЖДЕНИЯ";
		Lang.txt[0][530] = "1. Политика Администрации игры:\n1.1 Незнание или непонимание правил не освобождает от ответственности за их нарушение.\n1.2 Администрация игры не гарантирует надёжную работу в предоставлении услуг и сервисов, а также не несет ответственности за ущерб, который может быть причинён пользователям вследствие сбоев в линиях связи, ошибочного использования предоставляемых услуг, дефектов программного обеспечения и других действий, которые могут привести к возникновению нежелательных ситуаций.\n1.3 Администрация игры не занимается вопросами, связанными с куплей, продажей или выдачей аккаунтов, предметов игрового инвентаря. Все доступные предметы вы можете купить через внутриигровой магазин.\n1.4 Администрация оставляет за собой право распоряжения всеми игровыми объектами на всех аккаунтах по своему усмотрению.\n1.5 Администрация не занимается разбанами игровых аккаунтов, исключая те случаи, в которых бан произошел по вине Администрации игры.\n1.6 Попытка нарушения правил может приравниваться к совершенному нарушению.\n\n2.Администрация игры оставляет за собой право:\n2.1 Отказывать в предоставлении услуг без объяснения причин.\n2.2 Оценивать действия пользователей и накладывать на них какие-либо санкции в случаях, не предусмотренных данными правилами, если сочтёт это необходимым.\n2.3 Рассматривать и принимать решения по коллективным заявкам от пользователей.\n2.4 Вносить изменения в настоящие правила, без согласия пользователей.\n2.5 Вносить изменения в игру по своему усмотрению.\n\n3.Игровые аккаунты:\n3.1 Имена персонажей должны быть осмысленными, читаемыми и произносимыми.\n3.2 Запрещены нецензурные, вызывающие, оскорбительные или мешающие игровому процессу имена.\n3.3 Владелец страницы несет полную ответственность за все, что было сделано из-под его аккаунта.\n3.4 Запрещено совместное использование аккаунта, равно как и передача, покупка или продажа аккаунта.\n\n4.Игровой процесс:\n4.1 Запрещено совершать какие либо действия, которые могут нарушить игровой процесс или приводить к нестабильной работе игровых серверов. Также запрещено утаивание информации о таких действиях.\n4.2 Запрещены ругательства, нецензурные выражения, оскорбления, угрозы, вымогательство, шантаж, сексуальные домогательства, разжигание межнациональной, межклассовой или межрасовой розни и т.д.и т.п.\n4.3 Запрещено выдавать себя за Администрацию игры.\n4.4 Запрещено требовать у других игроков информацию, которую они считают секретной.Запрещено выпрашивание паролей, номеров телефонов и любой другой информации, позволяющей получить доступ к игровому аккаунту.\n4.5 Запрещено неуважительное обращение к Администрации игры. Оспаривание действий Администрации разрешается только через техническую поддержку игры.\n4.6 Запрещено распускание слухов, дезинформация о Администрации игры, равно как и о других игроках.\n4.7 Запрещено попрошайничать, донимать просьбами Администрацию игры.\n4.8 Запрещен флуд и спам, реклама и антиреклама.\n4.9 Запрещены любые виды мошенничества.\n4.10 Запрещено использование программ или любых других дополнительных средств, дающих игроку преимущество над другими игроками (читы, хаки, баги, модификации для браузеров, специальные браузеры, высокий пинг).\n4.11 Запрещена прокачка игровых персонажей(ботоводство).\n4.12 Об игровых недоработках разрешено писать только технической поддерже игры.\n\n5.Общение с Администрацией игры.\n5.1 Задавать вопросы рекомендуется только технической поддержке игры через личные сообщения.Информация об агентах технической поддержки игры указана в контактах официальной группы игры.\n5.2 При общении с Администрацией игры игрок должен кратко, внятно и без использования сленга рассказать о своей проблеме или ответить на заданные Администратором вопросы.\n5.3 Запрещается просить Администратора сделать что - либо, что не входит в его обязанности.\n5.4 При ответах на вопросы Администратора запрещается утаивание информации, ложь, введение в заблуждение.\n5.5 Запрещается вызывать Администратора на сервер без причины, создавать препятствия и отвлекать Администратора от выполнения обязанностей.\n5.6 Администратор не отвечает на вопросы по игровому процессу.Для этого есть официальная группа игры.\n\n6.В случае утери игровых аккаунтов, предметов:\n6.1 Если это произошло вследствие взлома защиты или внутренней ошибки сервера то Администрация по возможности возвращает вещи пострадавшим.\n6.2 В случае нарушения пунктов 3.4, 4.9, 4.10 Администрация ответственности не несет.\n\n7.При нарушении правил игры, Администрация игры может применять следующие санкции к игровым аккаунтам нарушителей:\n7.1 Полное или частичное обнуление аккаунта - Удаление всех предметов, обнуление статистики и прочее.\n7.2 Бан аккаунта - временное или постоянное блокирование аккаунта.\n7.3 Откат аккаунта - возврат аккаунта к определенному состоянию до того, как игрок нарушил правила.\n7.4 Другие действия, ограничивающие возможности игрока.";
		Lang.txt[0][531] = "ПРАВИЛА";
		Lang.txt[0][532] = "НАЗАД";
		Lang.txt[0][533] = "ФИЛЬТР ЧАТА";
		Lang.txt[0][534] = "ПОЗДРАВЛЯЕМ БОЕЦ!";
		Lang.txt[0][535] = "ТЫ УСПЕШНО\nВЫПОЛНИЛ ЗАДАНИЕ!\nТВОЯ НАГРАДА:\nСКОРПИОН";
		Lang.txt[0][536] = " МОНЕТ!\nА ТАКЖЕ, В ИНВЕНТАРЕ ВАС ЖДЕТ МАЛЕНЬКИЙ СЮРПРИЗ!\nПОЗДРАВЛЯЕМ!";
		Lang.txt[0][537] = "ХЭЛЛОУИН";
		Lang.txt[0][538] = "НОВЫЙ ГОД";
		Lang.txt[0][539] = "СНЕЖКИ";
		Lang.txt[0][540] = "ВНИМАНИЕ!\nИграть в снежки могут только игроки\nв новогодних скинах!";
		Lang.txt[0][541] = "СТАТИСТИКА";
		Lang.txt[0][542] = "ЗАЛ СЛАВЫ";
		Lang.txt[0][543] = "Тихий убийца";
		Lang.txt[0][544] = "Гринч";
		Lang.txt[0][545] = "ПОЗДРАВЛЯЕМ, БОЕЦ!";
		Lang.txt[0][546] = "ВЫ УСПЕШНО ЗАВЕРШИЛИ\nНОВОГОДНЕЕ ПРИКЛЮЧЕНИЕ 2018!\nВЫ ПОЛУЧИЛИ НАБОР ОРУЖИЯ\nИЗ СЕРИИ \"ЗИМНИЙ КАМУФЛЯЖ\",\nСПЕЦИАЛЬНУЮ НАГРАДУ В ЗАЛ СЛАВЫ,\nА ТАКЖЕ ДОПОЛНИТЕЛЬНОЕ\nСНАРЯЖЕНИЕ";
		string[] array = Lang.txt[0];
		int num = 546;
		array[num] += " И БОНУС 50 МОНЕТ!";
		Lang.txt[0][547] = "У ВАС ЕЩЕ НЕТ НИ ОДНОЙ НАГРАДЫ!";
		Lang.txt[0][548] = "НОВОГОДНЕЕ ПРИКЛЮЧЕНИЕ 2017";
		Lang.txt[0][549] = "ДАННАЯ НАГРАДА СВИДЕТЕЛЬСТВУЕТ О ТОМ,\nЧТО ЕЕ ВЛАДЕЛЕЦ ПОЛНОСТЬЮ ЗАВЕРШИЛ УЧАСТИЕ\nВ АКЦИИ НОВОГОДНЕЕ ПРИКЛЮЧЕНИЕ 2017.\n\n\nЦЕННОСТЬ НАГРАДЫ: 5000 ОПЫТА К РАНГУ ИГРОКА";
		Lang.txt[0][550] = "ВЫ УСПЕШНО ЗАВЕРШИЛИ\nНОВОГОДНЕЕ ПРИКЛЮЧЕНИЕ 2018!\nВЫ ПОЛУЧИЛИ НАБОР ОРУЖИЯ\nИЗ СЕРИИ \"ЗИМНИЙ КАМУФЛЯЖ\",\nСПЕЦИАЛЬНУЮ НАГРАДУ В ЗАЛ СЛАВЫ,\nА ТАКЖЕ ДОПОЛНИТЕЛЬНОЕ\nСНАРЯЖЕНИЕ";
		string[] array2 = Lang.txt[0];
		int num2 = 550;
		array2[num2] += " И БОНУС 50 МОНЕТ!";
		Lang.txt[0][551] = "РАЗМЕР КАРТЫ";
		Lang.txt[0][552] = "БОЛЬШАЯ";
		Lang.txt[0][553] = "СРЕДНЯЯ";
		Lang.txt[0][554] = "МАЛЕНЬКАЯ";
		Lang.txt[0][555] = "ДЕНЬ ПОБЕДЫ";
		Lang.txt[0][556] = "ЗОМБИ";
		Lang.txt[0][557] = "ПРИЗРАК";
		Lang.txt[0][558] = "БОСС";
		Lang.txt[0][559] = "Ассассин";
		Lang.txt[0][560] = "Харли";
		Lang.txt[0][561] = "Пеннивайз";
		Lang.txt[0][562] = "Джокер";
		Lang.txt[0][563] = "Пила";
		Lang.txt[0][564] = "Пугало";
		Lang.txt[0][565] = "Ученый";
		Lang.txt[0][566] = "Скелет";
		Lang.txt[0][569] = "Арчер";
		Lang.txt[0][570] = "Дюк";
		Lang.txt[0][571] = "Инженер";
		Lang.txt[0][572] = "Кестрель";
		Lang.txt[0][573] = "Охранник";
		Lang.txt[0][574] = "НОВОГОДНЕЕ ПРИКЛЮЧЕНИЕ 2018";
		Lang.txt[0][575] = "ДАННАЯ НАГРАДА СВИДЕТЕЛЬСТВУЕТ О ТОМ,\nЧТО ЕЕ ВЛАДЕЛЕЦ ПОЛНОСТЬЮ ЗАВЕРШИЛ УЧАСТИЕ\nВ АКЦИИ НОВОГОДНЕЕ ПРИКЛЮЧЕНИЕ 2018.\n\n\nЦЕННОСТЬ НАГРАДЫ: 5000 ОПЫТА К РАНГУ ИГРОКА";
		Lang.txt[0][576] = "ПИСТОЛЕТЫ";
		Lang.txt[0][577] = "ПИСТОЛЕТЫ-ПУЛЕМЕТЫ";
		Lang.txt[0][578] = "АВТОМАТЫ";
		Lang.txt[0][579] = "ПУЛЕМЕТЫ";
		Lang.txt[0][580] = "СНАЙПЕРСКИЕ ВИНТОВКИ";
		Lang.txt[0][581] = "ДРОБОВИКИ";
		Lang.txt[0][582] = "ХОЛОДНОЕ ОРУЖИЕ";
		Lang.txt[0][583] = "РАЗНОЕ";
		Lang.txt[0][584] = "ГУСЕНИЧНАЯ ТЕХНИКА";
		Lang.txt[0][585] = "КОЛЕСНАЯ ТЕХНИКА";
		Lang.txt[0][586] = "САМОЛЕТЫ";
		Lang.txt[0][587] = "ВЕРТОЛЕТЫ";
		Lang.txt[0][588] = "ВОДНАЯ ТЕХНИКА";
		Lang.txt[0][589] = "СКИНЫ ПЕРСОНАЖА";
		Lang.txt[0][590] = "СКИНЫ ТЕХНИКИ";
		Lang.txt[0][591] = "ЗНАЧКИ";
		Lang.txt[0][592] = "ШАПКИ";
		Lang.txt[0][593] = "ЗАЩИТА ПЕРСОНАЖА";
		Lang.txt[0][594] = "МЕДИЦИНА";
		Lang.txt[0][595] = "ГРАНАТЫ";
		Lang.txt[0][596] = "ГРАНАТОМЕТЫ";
		Lang.txt[0][597] = "ВЗРЫВЧАТКА";
		Lang.txt[0][598] = "БАРРИКАДЫ";
		Lang.txt[0][599] = "ПОДАРКИ";
		Lang.txt[0][600] = "ПРЕМИУМ";
		Lang.txt[0][601] = "РЕЖИМЫ";
		Lang.txt[0][602] = "КАРТЫ";
		Lang.txt[0][603] = "КЛАН";
		Lang.txt[0][604] = "МЕГАПАКИ";
		Lang.txt[0][605] = "РАЗНОЕ";
		Lang.txt[0][606] = "СНАРЯДЫ ДЛЯ ТЕХНИКИ";
		Lang.txt[0][621] = "СТАНДАРТ";
		Lang.txt[0][622] = "LADY ИЗДАНИЕ";
		Lang.txt[0][623] = "ZOMBIE ИЗДАНИЕ";
		Lang.txt[0][624] = "ДЕНЬ ПОБЕДЫ!";
		Lang.txt[0][625] = "НОВЫЙ ГОД!";
		Lang.txt[0][626] = "HALLOWEEN";
		Lang.txt[0][641] = "ВСЕМИРНЫЙ ДЕНЬ АВИАЦИИ И КОСМОНАВТИКИ!";
		Lang.txt[0][642] = "УБИТЬ <color=yellow>{0}</color> ИГРОКОВ ИЗ ЛЮБОГО <color=yellow>АВТОМАТА</color>";
		Lang.txt[0][643] = "УБИТЬ <color=yellow>{0}</color> ИГРОКОВ ИЗ ЛЮБОГО <color=yellow>ПУЛЕМЕТА</color>";
		Lang.txt[0][644] = "УБИТЬ <color=yellow>{0}</color> ИГРОКОВ ИЗ ЛЮБОЙ <color=yellow>СНАЙПЕРСКОЙ ВИНТОВКИ</color>";
		Lang.txt[0][645] = "УБИТЬ <color=yellow>{0}</color> ИГРОКОВ С ПОМОЩЬЮ\nЛЮБОГО <color=yellow>ХОЛОДНОГО ОРУЖИЯ</color> НА ЛЮБОМ РЕЖИМЕ,\n<color=yellow>КРОМЕ РЕЗНИ</color>";
		Lang.txt[0][646] = "ВЗОРВАТЬ <color=yellow>{0}</color> ИГРОКОВ С ПОМОЩЬЮ <color=yellow>TNT</color>, <color=yellow>C4</color> ИЛИ <color=yellow>МИНЫ</color>";
		Lang.txt[0][647] = "ВЗОРВАТЬ <color=yellow>{0}</color> ИГРОКОВ С ПОМОЩЬЮ <color=yellow>ШМЕЛЯ</color>, <color=yellow>РПГ7</color>,\n<color=yellow>МИНОМЕТА</color> ИЛИ <color=yellow>М202</color>";
		Lang.txt[0][648] = "ВЗОРВАТЬ <color=yellow>{0}</color> ИГРОКОВ С ПОМОЩЬЮ <color=yellow>M61</color>, <color=yellow>MK3</color> ИЛИ <color=yellow>РКГ3</color>";
		Lang.txt[0][649] = "ОТРАВИТЬ ИЛИ СЖЕЧЬ <color=yellow>{0}</color> ИГРОКОВ";
		Lang.txt[0][650] = "УБИТЬ <color=yellow>{0}</color> ИГРОКОВ НА РАССТОЯНИИ <color=yellow>ОТ 50 БЛОКОВ</color>\nИЗ ЛЮБОЙ <color=yellow>СНАЙПЕРСКОЙ ВИНТОВКИ</color>";
		Lang.txt[0][651] = "В ТЕЧЕНИЕ <color=yellow>1 МИНУТЫ</color> ОТОМСТИТЬ СВОЕМУ\n<color=yellow>ПОСЛЕДНЕМУ УБИЙЦЕ</color>.\nКОЛИЧЕСТВО ВЕНДЕТТ - <color=yellow>{0}</color>";
		Lang.txt[0][652] = "СОВЕРШИТЬ <color=yellow>{0}</color> ХЕДШОТОВ";
		Lang.txt[0][653] = "СБИТЬ <color=yellow>{0}</color> КАСОК";
		Lang.txt[0][654] = "УБИТЬ <color=yellow>50</color> ИГРОКОВ ВЫШЕ СЕБЯ УРОВНЕМ\n(ЗАСЧИТЫВАЕТСЯ КАК <color=yellow>10</color> ОЧКОВ)\n<color=yellow>ЛИБО</color> УБИТЬ <color=yellow>{0}</color> ИГРОКОВ СВОЕГО, ИЛИ НИЖЕ СЕБЯ УРОВНЕМ\n(ЗАСЧИТЫВАЕТСЯ КАК <color=yellow>1</color> ОЧКО)\n\n(НЕОБХОДИМО НАБРАТЬ <color=yellow>500</color> ОЧКОВ)";
		Lang.txt[0][656] = "НАНЕСТИ <color=yellow>{0}</color> УРОНА <color=yellow>СИНЕЙ</color> КОМАНДЕ";
		Lang.txt[0][657] = "НАНЕСТИ <color=yellow>{0}</color> УРОНА <color=yellow>КРАСНОЙ</color> КОМАНДЕ";
		Lang.txt[0][658] = "НАНЕСТИ <color=yellow>{0}</color> УРОНА <color=yellow>ЗЕЛЕНОЙ</color> КОМАНДЕ";
		Lang.txt[0][659] = "НАНЕСТИ <color=yellow>{0}</color> УРОНА <color=yellow>ЖЕЛТОЙ</color> КОМАНДЕ";
		Lang.txt[0][660] = "УБИТЬ <color=yellow>{0}</color> ИГРОКОВ ИСПОЛЬЗУЯ\n<color=yellow>ЛЮБОЕ ОРУЖИЕ С ГЛУШИТЕЛЕМ</color>";
		Lang.txt[0][661] = "ЗДРАВИЯ ЖЕЛАЕМ, БОЙЦЫ БЛОКАДЫ!\nМЫ РАДЫ ПРЕДСТАВИТЬ ВАМ <color=red>НОВОГОДНЕЕ ПРИКЛЮЧЕНИЕ 2018</color>!\nЗАЖГИТЕ ВСЕ ОГНИ НА ЕЛКЕ, ВКЛЮЧАЯ ЗВЕЗДУ, ПООЧЕРЕДНО ВЫПОЛНЯЯ МИССИИ.\nПОСЛЕ ИХ ВЫПОЛНЕНИЯ ВЫ ПОЛУЧИТЕ <color=red>НАБОР ОРУЖИЯ\nИЗ СЕРИИ \"ЗИМНИЙ КАМУФЛЯЖ\"</color>,\n<color=red>СПЕЦИАЛЬНУЮ НАГРАДУ В ЗАЛ СЛАВЫ</color>, КОТОРАЯ ДАЕТ\n<color=red>5000</color> ОПЫТА К РАНГУ ИГРОКА, А ТАКЖЕ <color=red>ДОПОЛНИТЕЛЬНОЕ СНАРЯЖЕНИЕ</color>";
		string[] array3 = Lang.txt[0];
		int num3 = 661;
		array3[num3] += " \nИ БОНУС В ВИДЕ <color=red>50</color> МОНЕТ!";
		string[] array4 = Lang.txt[0];
		int num4 = 661;
		array4[num4] += "\n\n<b>УСЛОВИЯ ВЫПОЛНЕНИЯ МИССИЙ</b>:\n - ВЫПОЛНЕНИЕ МИССИЙ НА <color=red>ПРИВАТНЫХ СЕРВЕРАХ НЕВОЗМОЖНО</color>;\n - ВЫПОЛНЕНИЕ МИССИЙ ВОЗМОЖНО ТОЛЬКО НА СЕРВЕРАХ\nС КОЛИЧЕСТВОМ ИГРОКОВ <color=red>НЕ МЕНЕЕ 16-ТИ</color>(КРОМЕ РЕЖИМА ВЫЖИВАНИЕ);\n - ИГРОКИ, ПЫТАЮЩИЕСЯ ВЫПОЛНИТЬ МИССИИ <color=red>НЕЧЕСТНЫМ ПУТЕМ</color>,\nБУДУТ <color=red>НАКАЗАНЫ</color>;\n - ВСЕ МИССИИ ВЫПОЛНЯЮТСЯ <color=red>В СТРОГОЙ ПОСЛЕДОВАТЕЛЬНОСТИ</color>.\nЗАДАНИЯ ВНУТРИ МИССИИ ВЫПОЛНЯЮТСЯ ОДНОВРЕМЕННО\n - ДЛЯ <color=red>ПОЛНОГО ЗАВЕРШЕНИЯ</color> ТЕКУЩЕЙ МИССИИ <color=red>НЕОБХОДИМО</color>\nОТКРЫТЬ ОКНО <color=red>НОВОГОДНЕГО ПРИКЛЮЧЕНИЯ</color>.\nВ НЕМ ВЫ УВИДИТЕ <color=red>УСЛОВИЯ СЛЕДУЮЩЕЙ МИССИИ</color>.\n\nКОМАНДА РАЗРАБОТЧИКОВ ИГРЫ <color=red>БЛОКАДА</color>\nЖЕЛАЕТ ВАМ <color=red>СЧАСТЛИВОГО НОВОГО ГОДА</color> И <color=red>ХОРОШЕГО НАСТРОЕНИЯ</color>!!!";
		Lang.txt[0][662] = "НОВОГОДНЕЕ ПРИКЛЮЧЕНИЕ 2018";
		Lang.txt[0][663] = "ПО ЗАВЕРШЕНИЮ ВСЕХ МИССИЙ ВЫ ПОЛУЧИТЕ\n<color=red>СПЕЦИАЛЬНУЮ НАГРАДУ В ЗАЛ СЛАВЫ</color>, А ТАКЖЕ\n<color=red>ДОПОЛНИТЕЛЬНОЕ СНАРЯЖЕНИЕ</color>";
		string[] array5 = Lang.txt[0];
		int num5 = 663;
		array5[num5] += " И БОНУС В ВИДЕ <color=red>50</color> МОНЕТ.";
		Lang.txt[0][664] = "ПО ЗАВЕРШЕНИЮ ВСЕХ МИССИЙ ВЫ ПОЛУЧИТЕ\nСПЕЦИАЛЬНУЮ НАГРАДУ В ЗАЛ СЛАВЫ, А ТАКЖЕ\nДОПОЛНИТЕЛЬНОЕ СНАРЯЖЕНИЕ";
		string[] array6 = Lang.txt[0];
		int num6 = 664;
		array6[num6] += " И БОНУС В ВИДЕ 50 МОНЕТ.";
		Lang.txt[0][665] = "^3NOVALINK АНТИЧИТ^8: ИГРОК ";
		Lang.txt[0][666] = "  ^8ЗАБАНЕН ЗА ИСПОЛЬЗОВАНИЕ ЧИТОВ!";
		Lang.txt[0][667] = "ПЛАН ПОБЕДЫ";
		Lang.txt[0][668] = "ДАННАЯ НАГРАДА СВИДЕТЕЛЬСТВУЕТ О ТОМ,\nЧТО ЕЕ ВЛАДЕЛЕЦ ПОЛНОСТЬЮ ЗАВЕРШИЛ УЧАСТИЕ\nВ АКЦИИ ПЛАН ПОБЕДЫ\n\n\nЦЕННОСТЬ НАГРАДЫ: 5000 ОПЫТА К РАНГУ ИГРОКА";
		Lang.txt[0][700] = "Пригодятся, когда противник спрятался за углом.";
		Lang.txt[0][701] = "Оружие - легенда.";
		Lang.txt[0][702] = "Почему у этого оружия такой странный звук выстрела?";
		Lang.txt[0][703] = "Тем, кому нравится хромированное оружие.";
		Lang.txt[0][704] = "Когда лень целиться.";
		Lang.txt[0][705] = "Пользуется спросом среди бойцов Спецназа.";
		Lang.txt[0][706] = "Компактный автомат.";
		Lang.txt[0][707] = "Маленький да удаленький.";
		Lang.txt[0][708] = "Классика жанра.";
		Lang.txt[0][709] = "Ручной зверь.";
		Lang.txt[0][710] = "Альфа на ближних дистанциях.";
		Lang.txt[0][711] = "Все просят убрать, но продолжают с ним играть.";
		Lang.txt[0][712] = "Снайперская винтовка спецназа.";
		Lang.txt[0][713] = "Аптечка для ранки.";
		Lang.txt[0][714] = "Аптечка для небольшого перелома.";
		Lang.txt[0][715] = "Аптечка почти способная вернуть вас с того света.";
		Lang.txt[0][716] = "Тихий убийца.";
		Lang.txt[0][717] = "Каждый выстрел на вес золота.";
		Lang.txt[0][718] = "Вроде пистолет, но в тоже время автомат.";
		Lang.txt[0][719] = "Тюремная заточка, кто ее пронёс в игру?";
		Lang.txt[0][720] = "Брать в случае пожара, ну или если вам хочется кого-нибудь проучить.";
		Lang.txt[0][721] = "Бейсбол, только вместо мячиков головы противников.";
		Lang.txt[0][722] = "Ломать блоки? Запросто! Ломать кости противникам? Тоже можно!";
		Lang.txt[0][723] = "Вкусная палка-сосалка!";
		Lang.txt[0][724] = "Обычный блок. Только взрывоопасный, и довольно веселый.";
		Lang.txt[0][725] = "Их было раньше так много, что их раздавали бесплатно. Но потом их поставки резко сократились. Почему? Неизвестно.";
		Lang.txt[0][726] = "Если хочется оптического прицела, но не хочется снайперской винтовки.";
		Lang.txt[0][727] = "Миномет, судя по звукам, стреляющий кипящими чайниками.";
		Lang.txt[0][728] = "Обвешанная версия классической М14.";
		Lang.txt[0][729] = "Способна выключить и слона.";
		Lang.txt[0][730] = "Новая звезда среди класса дробовиков.";
		Lang.txt[0][731] = "Как они вообще его носят в руках?";
		Lang.txt[0][732] = "Для ценителей классики, в то же время для настоящих рисковых ребят!";
		Lang.txt[0][733] = "Оставь шрамы на лицах противников.";
		Lang.txt[0][734] = "Для тихих разборок.";
		Lang.txt[0][735] = "'Лечу далеко, взрываюсь от контакта с чем-либо.' - так было написано в заказе.";
		Lang.txt[0][736] = "Контрабандисты их привозят настолько много, что их стали раздавать бесплатно.";
		Lang.txt[0][737] = "'Можно заряжать в них специальные гранаты.'  - так было написано в заказе.";
		Lang.txt[0][738] = "'Так же можно заряжать в них специальные гранаты.'  - так было написано в заказе.";
		Lang.txt[0][739] = "Факт: такт стрельбы этого оружия почти равен такту цокания лошадинных копыт при галопе.";
		Lang.txt[0][740] = "Когда хочется устроить армагеддон!";
		Lang.txt[0][741] = "Эту винтовку привезли прямиком из прошлого века.";
		Lang.txt[0][742] = "Этого зверька привезли прямиком из прошлого века.";
		Lang.txt[0][743] = "Эту экзотику привезли прямиком из прошлого века.";
		Lang.txt[0][744] = "Маленький, компактный, и настолько легкий что его можно перезарядить буквально за 1 секунду.";
		Lang.txt[0][745] = "Большой, неудобный, но настолько легкий что его можно перезарядить буквально за 1 секунду.";
		Lang.txt[0][746] = "Итальянские страсти, жаль нельзя взять сразу 2. Или можно?";
		Lang.txt[0][747] = "Всё трещит, всё хрустит, это мы пробиваемся сквозь джунгли. Джунгли людей.";
		Lang.txt[0][748] = "У тебя танк? У меня РПГ 7.";
		Lang.txt[0][749] = "На самом деле это барабанная палка, которой надо бить по барабанам в виде танков.";
		Lang.txt[0][750] = "Странное оружие. С виду автомат, а внутри дробовик.";
		Lang.txt[0][751] = "Оружие настоящих шпионов.";
		Lang.txt[0][752] = "Странное по форме оружие. Подарок от инопланетян?";
		Lang.txt[0][753] = "Гордость нации.";
		Lang.txt[0][754] = "Было бы весело, если бы у меня было умение замедлять время и в наличии имелось бы 2 таких зверька. Хотя нет, плохая идея.";
		Lang.txt[0][755] = "Серьезный аргумент в споре кому жить а кому умирать.";
		Lang.txt[0][756] = "Маленький. Можно положить в карман, никто и не заметит.";
		Lang.txt[0][757] = "Современный, удобный, смертоностный. Что еще нужно для полного счастья?";
		Lang.txt[0][758] = "Компактный пистолет-пулемет.";
		Lang.txt[0][759] = "Игрок с NTW 20, или NTW 20 с игроком в руках?";
		Lang.txt[0][760] = "Камуфляж? Вы смеетесь? Так еще и урон? Вот теперь понятно.";
		Lang.txt[0][761] = "Решение для споров между танками.";
		Lang.txt[0][762] = "Массовое решение для споров между танком и пехотой. В пользу первых.";
		Lang.txt[0][763] = "Второе дыхание для умирающего танка.";
		Lang.txt[0][764] = "Решение для споров между танком и пехотой. В пользу первых.";
		Lang.txt[0][765] = "Почувствуй себя героем фантастического фильма!";
		Lang.txt[0][766] = "Это ракета с автоматическим наведением, способна уничтожить танк за 1 секунду. Была бы еще чуть умней - писала бы книги. И сама бы их читала. ";
		Lang.txt[0][767] = "Меньше, но проворнее.";
		Lang.txt[0][768] = "Баланс нужен во всём.";
		Lang.txt[0][769] = "Больше, но медлительнее.";
		Lang.txt[0][770] = "Странное оружие. С виду автомат, а внутри дробовик. Версия, специльно разработанная против зомби. Им становится плохо когда они видят эту ужасную покраску.";
		Lang.txt[0][771] = "Пользуется спросом среди бойцов Спецназа. Версия, специально разработанная против зомби. Им становится плохо когда они видят эту ужасную покраску.";
		Lang.txt[0][772] = "Оружие настоящих шпионов. Версия, специально разработанная против зомби. Им становится плохо когда они видят эту ужасную покраску.";
		Lang.txt[0][773] = "Как они вообще его носят в руках? Версия, специально разработанная против зомби. Им становится плохо когда они видят эту ужасную покраску.";
		Lang.txt[0][774] = "Ручной зверь. Версия, специально разработанная против зомби. Им становится плохо когда они видят эту ужасную покраску.";
		Lang.txt[0][775] = "Почувствуй себя героем фантастического фильма! Версия, специально разработанная против зомби. Им становится плохо когда они видят эту ужасную покраску.";
		Lang.txt[0][776] = "Альфа на ближних дистанциях. Версия, специально разработанная против зомби. Им становится плохо когда они видят эту ужасную покраску.";
		Lang.txt[0][777] = "Третий шанс тоже не помешает.";
		Lang.txt[0][778] = "В них довольно тепло. Они что, с утиплителем?";
		Lang.txt[0][779] = "Кому сломать ко… то есть, заменить водопроводную трубу?";
		Lang.txt[0][780] = "Средневековая жестокость.";
		Lang.txt[0][781] = "Способна с ювелирной точностью разделить голову противника на две равные части.";
		Lang.txt[0][782] = "Этот пистолет привезли прямиком из прошлого века.";
		Lang.txt[0][783] = "Факт: из этого оружия можно убить стоя на противоположном краю карты.";
		Lang.txt[0][784] = "Довольно качественное оружие.";
		Lang.txt[0][785] = "Лучше не использовать в маленьких помещениях. Последствия будут фатальны.";
		Lang.txt[0][786] = "Вас не видно, вы никого не видите. И так приятно пахнет.";
		Lang.txt[0][787] = "Способна вывести из строя технику противника. Если сможете её докинуть, конечно.";
		Lang.txt[0][788] = "Мало кто знает, но мины можно закапывать под землю!";
		Lang.txt[0][789] = "Левая коронная, правая похоронная.";
		Lang.txt[0][790] = "Нашел тесак, где теперь взять крюк мясника?";
		Lang.txt[0][791] = "Можно устроить спартанские состязания.";
		Lang.txt[0][792] = "Младший брат легенды.";
		Lang.txt[0][793] = "Говорите для стрельбы по мухам? Сомневаюсь.";
		Lang.txt[0][794] = "Оружие для настоящих авторитетов.";
		Lang.txt[0][795] = "На случай важных раскопок.";
		Lang.txt[0][796] = "Уникальное оружие, придуманное разработчиками игры. ";
		Lang.txt[0][797] = "Стандарт. Есть игроки, которым кроме этого оружия ничего и не надо.";
		Lang.txt[0][798] = "Некоторые игроки называют это оружие 'морковкой'. С чего бы это?";
		Lang.txt[0][799] = "Советский пулемет времен Второй Мировой.";
		Lang.txt[0][800] = "Французский пулемет времен Второй Мировой.";
		Lang.txt[0][801] = "Немецкий пулемет времен Второй Мировой.";
		Lang.txt[0][802] = "Британский пистолет-пулемет времен Второй Мировой.";
		Lang.txt[0][803] = "Американский пистолет-пулемет времен Второй Мировой.";
		Lang.txt[0][804] = "Японский пулемет времен Второй Мировой.";
		Lang.txt[0][805] = "Стандартный дробовик. Способен убить с одного выстрела в упор.";
		Lang.txt[0][806] = "Стандартный пистолет. Можно проковырять дырку в голове противника.";
		Lang.txt[0][807] = "4-ых ствольный гранатомет. Способен выпустить, как ни странно, 4 ракеты.";
		Lang.txt[0][808] = "Противотанковая мина. Уничтожает технику противника.";
		Lang.txt[0][809] = "Напалм, от которого у врага подгорает одно место. Наносит периодический урон.";
		Lang.txt[0][810] = "Такие токсины варит некий профессор, известный как 'Токсик'.";
		Lang.txt[0][811] = "Веселье на 4-ых колесах с бортовым пулеметом.";
		Lang.txt[0][812] = "Единственный способ покалечить едой в игре.";
		Lang.txt[0][813] = "Наследие сыновей двух легендарных оружестроителей.";
		Lang.txt[0][814] = "Гроза пабликов. И не только. Имеет встроенный гранатомёт.";
		Lang.txt[0][815] = "В настоящее время существует лишь 1 работоспособная копия. Она в Блокаде.";
		Lang.txt[0][816] = "Пилим, выпиливаем. Леса. Леса трупов.";
		Lang.txt[0][817] = "H&K PSG-1. Очень точная, скорострельная и надежная модель.";
		Lang.txt[0][818] = "Ручной пулемет Krytac. А такой пулемет вообще существует?";
		Lang.txt[0][819] = "Оружие отряда специального назначения.";
		Lang.txt[0][820] = "Спаренные позолоченные кольты. В самых лучших традициях боевиков!";
		Lang.txt[0][821] = "Револьвер размером с женскую сумочку и сногсшибательной убойностью.";
		Lang.txt[0][822] = "Чешский специальный автоматический пистолет, разработанный для вооружения танкистов, связистов и военнослужащих других специальностей.";
		Lang.txt[0][823] = "Современный представитель раскладных пистолетов-пулеметов.";
		Lang.txt[0][824] = "Охотничий карабин-дробовик на базе легендарного автомата.";
		Lang.txt[0][825] = "Отличное оружие для любителей \"позажигать\".";
		Lang.txt[0][826] = "ЯЗЫК";
		Lang.txt[0][827] = " - ИДЕТ ИГРА";
		Lang.txt[0][828] = " - НАБОР";
		Lang.txt[0][830] = "БИТВА";
		Lang.txt[0][831] = "АЛЬФА";
		Lang.txt[0][832] = "СТРОЙКА";
		Lang.txt[0][833] = "ЗОМБИ";
		Lang.txt[0][834] = "ЗАХВАТ";
		Lang.txt[0][835] = "КОНТРА";
		Lang.txt[0][836] = "РЕЗНЯ";
		Lang.txt[0][837] = "ВЫЖИВАНИЕ";
		Lang.txt[0][838] = "1945-й";
		Lang.txt[0][839] = "ПРОРЫВ";
		Lang.txt[0][840] = "ЗАЧИСТКА";
		Lang.txt[0][841] = "ТАНКИ";
		Lang.txt[0][842] = "СНЕЖКИ";
		Lang.txt[0][843] = "ДОМИНАЦИЯ";
		Lang.txt[0][850] = "ДРУЗЕЙ В ИГРЕ НЕ НАЙДЕНО...";
		Lang.txt[0][855] = "АКЦИИ";
		Lang.txt[0][856] = "МОНЕТЫ";
		Lang.txt[0][857] = "ИСТОРИЯ";
		Lang.txt[0][860] = "ПАКЕТ \"ВСЕ ОРУЖИЕ\"";
		Lang.txt[0][861] = "ПОДТВЕРЖДЕНА";
		Lang.txt[0][862] = "ОТМЕНЕНА";
		Lang.txt[0][863] = "ОБНОВИТЬ";
		Lang.txt[0][864] = "ДАТА";
		Lang.txt[0][865] = "ПОКУПКА";
		Lang.txt[0][866] = "СТОИМОСТЬ";
		Lang.txt[0][867] = "СТАТУС";
		Lang.txt[0][868] = "ЗАГРУЗКА ИСТОРИИ...";
		Lang.txt[0][869] = "ОБНОВЛЕНИЕ...";
		Lang.txt[0][870] = "ПОКАЗАТЬ ОТМЕНЕННЫЕ ТРАНЗАКЦИИ";
		Lang.txt[0][871] = "ТРАНЗАКЦИЙ НЕ НАЙДЕНО!";
		Lang.txt[0][872] = "С ДНЕМ ПОБЕДЫ!";
		Lang.txt[0][873] = "Поздравляем Боец!\nВы получили 20 монет!!\nОстальные подарки\nуже в инвентаре.";
		Lang.txt[0][874] = " KARTRIDGE НЕ ЗАПУЩЕН!";
		Lang.txt[0][875] = " NOVALINK НЕ ЗАПУЩЕН!";
		Lang.txt[0][876] = " STEAM НЕ ЗАПУЩЕН!";
		Lang.txt[0][877] = " ВЫ ДОЛЖНЫ БЫТЬ АВТОРИЗОВАНЫ В КЛИЕНТЕ KARTRIDGE.";
		Lang.txt[1][0] = "Create new";
		Lang.txt[1][1] = "You have a deleted clan";
		Lang.txt[1][2] = "Restore clan";
		Lang.txt[1][3] = "Or you can join existing clan";
		Lang.txt[1][4] = "Find clan";
		Lang.txt[1][5] = "Clan name";
		Lang.txt[1][6] = "There is only 10+ level players or premium users can create a clan";
		Lang.txt[1][7] = "You didn't applied any clan requests yet";
		Lang.txt[1][8] = "You must cancel all of your clan requests before finding clan";
		Lang.txt[1][9] = "Clan not found";
		Lang.txt[1][10] = "Clan";
		Lang.txt[1][11] = "Level";
		Lang.txt[1][12] = "Leader";
		Lang.txt[1][13] = "Slots";
		Lang.txt[1][14] = "Exp";
		Lang.txt[1][15] = "Level progress";
		Lang.txt[1][16] = "Clan leader";
		Lang.txt[1][17] = "Slots";
		Lang.txt[1][18] = "Since";
		Lang.txt[1][19] = "Delete clan";
		Lang.txt[1][20] = "Leave clan";
		Lang.txt[1][21] = "Manage clan";
		Lang.txt[1][22] = "Manage requests";
		Lang.txt[1][23] = "Discount increases with every purchase!";
		Lang.txt[1][24] = "Information";
		Lang.txt[1][25] = "Loading profile";
		Lang.txt[1][26] = "Thanks for start playing BLOCKADE, take your bonus - 20 coins!";
		Lang.txt[1][27] = "Bonus";
		Lang.txt[1][28] = "Settings saved";
		Lang.txt[1][29] = "Mouse Sensitivity";
		Lang.txt[1][30] = "Dynamic light";
		Lang.txt[1][31] = "Resolution";
		Lang.txt[1][32] = "Render distance";
		Lang.txt[1][33] = "Enter password to connect to ";
		Lang.txt[1][34] = "Cancel";
		Lang.txt[1][35] = "Connect";
		Lang.txt[1][36] = "Invalid password!";
		Lang.txt[1][37] = "Nickname";
		Lang.txt[1][38] = "Frags";
		Lang.txt[1][39] = "Deaths";
		Lang.txt[1][40] = "PREMIUM";
		Lang.txt[1][41] = "Premium:\n200% faster Exp, 200% number of blocks\nTemporary weapons: AK47, SVD, Grenades\nValidity time: 7 days";
		Lang.txt[1][42] = "REPORT ALLIES";
		Lang.txt[1][43] = "Take your bonus for level up to ";
		Lang.txt[1][44] = "PUBLIC";
		Lang.txt[1][45] = "PRIVATE";
		Lang.txt[1][46] = "Modes";
		Lang.txt[1][47] = "All modes";
		Lang.txt[1][48] = "Battle";
		Lang.txt[1][49] = "Build";
		Lang.txt[1][50] = "Zombie";
		Lang.txt[1][51] = "Capture";
		Lang.txt[1][52] = "Versus";
		Lang.txt[1][53] = "Carnage";
		Lang.txt[1][54] = "Survival";
		Lang.txt[1][55] = "Filter";
		Lang.txt[1][56] = "All servers";
		Lang.txt[1][57] = "Only available";
		Lang.txt[1][58] = "You were banned for cheating";
		Lang.txt[1][59] = "Build mode servers available in PRIVATE";
		Lang.txt[1][60] = "Only 20+ level users can play this mode";
		Lang.txt[1][61] = "Create server";
		Lang.txt[1][62] = "Only Premium users can create server";
		Lang.txt[1][63] = "Grenade";
		Lang.txt[1][64] = "Shmel";
		Lang.txt[1][65] = "TNT";
		Lang.txt[1][66] = "Quantity 200 pcs\nHint: Press G to use\n";
		Lang.txt[1][67] = "Quantity 50 pcs\nHint: Press Q to use\n";
		Lang.txt[1][68] = "Fire axe";
		Lang.txt[1][69] = "Knife";
		Lang.txt[1][70] = "Baseball bat";
		Lang.txt[1][71] = "Crowbar";
		Lang.txt[1][72] = "Melee weapons";
		Lang.txt[1][73] = "Defence";
		Lang.txt[1][74] = "Helmet";
		Lang.txt[1][75] = "Body armor";
		Lang.txt[1][76] = "Arctic";
		Lang.txt[1][77] = "1337";
		Lang.txt[1][78] = "Soldier";
		Lang.txt[1][79] = "Jane";
		Lang.txt[1][80] = "Kamikaze";
		Lang.txt[1][81] = "Insurgent";
		Lang.txt[1][82] = "Terrorist";
		Lang.txt[1][83] = "Pilot";
		Lang.txt[1][84] = "Sniper";
		Lang.txt[1][85] = "SAS";
		Lang.txt[1][86] = "Marine";
		Lang.txt[1][87] = "Spec Ops";
		Lang.txt[1][88] = "Survivor";
		Lang.txt[1][89] = "Bandit";
		Lang.txt[1][90] = "Veteran";
		Lang.txt[1][91] = "Pathfinder";
		Lang.txt[1][92] = "Skull";
		Lang.txt[1][93] = "Spetsnaz";
		Lang.txt[1][94] = "Assasin";
		Lang.txt[1][95] = "Visual skin Assasin\nValidity time: unlimited";
		Lang.txt[1][96] = "Medkit S";
		Lang.txt[1][97] = "Restores 25hp\nRequired level 1\nQuantity 200 pcs";
		Lang.txt[1][98] = "Medkit M";
		Lang.txt[1][99] = "Restores 50hp\nRequired level 13\nQuantity 200 pcs";
		Lang.txt[1][100] = "Medkit L";
		Lang.txt[1][101] = "Restores 100hp\nRequired level 21\nQuantity 200 pcs";
		Lang.txt[1][102] = "Clan +8";
		Lang.txt[1][103] = "Clan extension +8 slots";
		Lang.txt[1][104] = "Maps";
		Lang.txt[1][105] = "Slot";
		Lang.txt[1][106] = "Map slot extension";
		Lang.txt[1][107] = "Thanks for your pruchase!";
		Lang.txt[1][108] = "You already have this item .";
		Lang.txt[1][109] = "Not enough level.";
		Lang.txt[1][110] = "Damage";
		Lang.txt[1][111] = "ROF";
		Lang.txt[1][112] = "Clip";
		Lang.txt[1][113] = "Ammo";
		Lang.txt[1][114] = "Distance";
		Lang.txt[1][115] = "Take your 10 coin(s).!";
		Lang.txt[1][116] = "Admin menu";
		Lang.txt[1][117] = "Game mode";
		Lang.txt[1][118] = "Map ID";
		Lang.txt[1][119] = "Load";
		Lang.txt[1][120] = "Server password";
		Lang.txt[1][121] = "Set";
		Lang.txt[1][122] = "Reset";
		Lang.txt[1][123] = "Close";
		Lang.txt[1][124] = "Kick";
		Lang.txt[1][125] = "Access";
		Lang.txt[1][126] = "Team";
		Lang.txt[1][127] = "All";
		Lang.txt[1][128] = "WEAPONS";
		Lang.txt[1][129] = "My maps";
		Lang.txt[1][130] = "Apply sizing";
		Lang.txt[1][131] = "x width: ";
		Lang.txt[1][132] = "y height: ";
		Lang.txt[1][133] = "z length: ";
		Lang.txt[1][134] = "PREPARE FOR BATTLE";
		Lang.txt[1][135] = "INFECTION STARTED";
		Lang.txt[1][136] = "HUMAN WIN";
		Lang.txt[1][137] = "ZOMBIE WIN";
		Lang.txt[1][138] = "ROUND DRAW";
		Lang.txt[1][139] = "Fullscreen mode";
		Lang.txt[1][140] = "Disable chat";
		Lang.txt[1][141] = "Enable chat";
		Lang.txt[1][142] = "Disconnect";
		Lang.txt[1][143] = "Map#";
		Lang.txt[1][144] = "Resize";
		Lang.txt[1][145] = "Save changes";
		Lang.txt[1][146] = "Blue team";
		Lang.txt[1][147] = "Red team";
		Lang.txt[1][148] = "Green team";
		Lang.txt[1][149] = "Yellow team";
		Lang.txt[1][150] = "Human";
		Lang.txt[1][151] = "Connection";
		Lang.txt[1][152] = "Loading";
		Lang.txt[1][153] = "THE GAME STARTS IN";
		Lang.txt[1][154] = "ZOMBIES COMING (WAVE ";
		Lang.txt[1][155] = "NEXT WAVE IN 30 SEC!";
		Lang.txt[1][156] = "WAIT FOR THE NEXT ROUND!";
		Lang.txt[1][157] = "Please wait";
		Lang.txt[1][158] = "Choose your team!";
		Lang.txt[1][159] = " kicked ";
		Lang.txt[1][160] = "disallowed building to";
		Lang.txt[1][161] = "allowed building to";
		Lang.txt[1][162] = " saved map";
		Lang.txt[1][163] = " set the password to";
		Lang.txt[1][164] = " reset the password";
		Lang.txt[1][165] = "Lollipop";
		Lang.txt[1][166] = "Shovel";
		Lang.txt[1][167] = "Tileset";
		Lang.txt[1][168] = "near";
		Lang.txt[1][169] = "middle";
		Lang.txt[1][170] = "far";
		Lang.txt[1][171] = "Save";
		Lang.txt[1][172] = "Waiting for confirmation...";
		Lang.txt[1][173] = "Weapons";
		Lang.txt[1][174] = "Vehicles";
		Lang.txt[1][175] = "Equipment";
		Lang.txt[1][176] = "Skins";
		Lang.txt[1][177] = "Others";
		Lang.txt[1][178] = "You refused to buy";
		Lang.txt[1][179] = "ERROR! Something went wrong...";
		Lang.txt[1][180] = "BUY";
		Lang.txt[1][181] = "Assault";
		Lang.txt[1][182] = "Support";
		Lang.txt[1][183] = "Pistols";
		Lang.txt[1][184] = "Player skins";
		Lang.txt[1][185] = "Vehicle skins";
		Lang.txt[1][186] = "Hull";
		Lang.txt[1][187] = "Armor";
		Lang.txt[1][188] = "Speed";
		Lang.txt[1][189] = "Reload";
		Lang.txt[1][190] = "Aiming";
		Lang.txt[1][191] = "Tanks";
		Lang.txt[1][192] = "Tank equipment";
		Lang.txt[1][193] = "Ammunition";
		Lang.txt[1][194] = "Medicine";
		Lang.txt[1][195] = "Tank ammunition";
		Lang.txt[1][196] = "Clans";
		Lang.txt[1][197] = "Select a weapon to upgrade";
		Lang.txt[1][198] = "Select a vehicle to upgrade";
		Lang.txt[1][199] = "click on the desired option to upgrade weapon";
		Lang.txt[1][200] = "click on the desired option to upgrade vehicle";
		Lang.txt[1][201] = "Modules";
		Lang.txt[1][202] = "You are not in a clan";
		Lang.txt[1][203] = "Your current application to the clan - ";
		Lang.txt[1][204] = "CLAN ";
		Lang.txt[1][205] = "CONTINGENT";
		Lang.txt[1][206] = "BREAK POINT";
		Lang.txt[1][207] = "CLEANER";
		Lang.txt[1][208] = "TANKS";
		Lang.txt[1][209] = "DOWNLOADING: ";
		Lang.txt[1][210] = " FROM ";
		Lang.txt[1][211] = " BUNDLES";
		Lang.txt[1][212] = "WAITING FOR AUTHORIZATION";
		Lang.txt[1][213] = "WAITING FOR DOWNLOAD";
		Lang.txt[1][214] = "Downloading";
		Lang.txt[1][215] = "Main theme downloading";
		Lang.txt[1][216] = "Skins downloading";
		Lang.txt[1][217] = "Textures downloading";
		Lang.txt[1][218] = "Sounds downloading";
		Lang.txt[1][219] = "Models downloading";
		Lang.txt[1][220] = "Fonts downloading";
		Lang.txt[1][221] = "LAST CONFIGURATION";
		Lang.txt[1][222] = "ENTER TANK";
		Lang.txt[1][223] = "HATCH IS CLOSED";
		Lang.txt[1][224] = "Information:";
		Lang.txt[1][225] = "Helmet provides one-hit protection in the head";
		Lang.txt[1][226] = "Armor partially protects against bullets";
		Lang.txt[1][227] = " access ";
		Lang.txt[1][228] = "OK";
		Lang.txt[1][229] = "SHARE";
		Lang.txt[1][230] = "Congratulations soldier!\nTake your 20 coin(s)!\nCheck other stuff\nin inventory.";
		Lang.txt[1][231] = "Machete";
		Lang.txt[1][232] = "Used to repair/damage vehicles";
		Lang.txt[1][233] = "Wrench";
		Lang.txt[1][234] = "Mortar";
		Lang.txt[1][235] = "Launcher";
		Lang.txt[1][236] = "Uses GP-grenades as ammunition";
		Lang.txt[1][237] = "Javelin";
		Lang.txt[1][238] = "Antitank missile system\nAs ammunition used\nhoming missiles\nQuantity 25 pcs";
		Lang.txt[1][239] = "GP-grenade";
		Lang.txt[1][240] = "Quantity 50 pcs\nOnly for:\n";
		Lang.txt[1][241] = "Quantity 25 pcs\nHint: Press Q to use\n";
		Lang.txt[1][242] = "Effective against vehicles";
		Lang.txt[1][243] = "RPG-7";
		Lang.txt[1][244] = "Protects against one-time hit in the head\n";
		Lang.txt[1][245] = "Partially protects against bullets\n";
		Lang.txt[1][246] = "Validity time: unlimited";
		Lang.txt[1][247] = "Visual skin ";
		Lang.txt[1][248] = "Prisoner";
		Lang.txt[1][249] = "COP";
		Lang.txt[1][250] = "Mercgirl";
		Lang.txt[1][251] = "Killer";
		Lang.txt[1][252] = "Default";
		Lang.txt[1][253] = "Default skin";
		Lang.txt[1][254] = "Slender";
		Lang.txt[1][255] = "Freddy";
		Lang.txt[1][256] = "Jason";
		Lang.txt[1][257] = "Rorschach";
		Lang.txt[1][258] = "Zombie boy";
		Lang.txt[1][259] = "Zombie girl";
		Lang.txt[1][260] = "for light tank";
		Lang.txt[1][261] = "for medium tank";
		Lang.txt[1][262] = "for heavy tank";
		Lang.txt[1][263] = "Desert ";
		Lang.txt[1][264] = "Hexagon ";
		Lang.txt[1][265] = "Multicam ";
		Lang.txt[1][266] = "Tiger stripes ";
		Lang.txt[1][267] = "Wood";
		Lang.txt[1][268] = "LT";
		Lang.txt[1][269] = "MT";
		Lang.txt[1][270] = "HT";
		Lang.txt[1][271] = "Blockademan";
		Lang.txt[1][272] = "Soviet soldier";
		Lang.txt[1][273] = "German officer";
		Lang.txt[1][274] = "Mode";
		Lang.txt[1][275] = "Contra mode for private servers";
		Lang.txt[1][276] = "Gift";
		Lang.txt[1][277] = "A gift from the Administration\nOpen in inventory";
		Lang.txt[1][278] = "while moving player - shooting is not available";
		Lang.txt[1][279] = "weapon has variational damage";
		Lang.txt[1][280] = "reload rate increased";
		Lang.txt[1][281] = "damage, armor-piercing, clip increased";
		Lang.txt[1][282] = "Quantity 50 pcs\n";
		Lang.txt[1][283] = "ZBK18M";
		Lang.txt[1][284] = "Cumulative shels for tank\n";
		Lang.txt[1][285] = "ZOF26";
		Lang.txt[1][286] = "High-explosive shels for tank\n";
		Lang.txt[1][287] = "Effective against vehicles\n";
		Lang.txt[1][288] = "Effective against infantry\n";
		Lang.txt[1][289] = "Hint: Press Q to use";
		Lang.txt[1][290] = "Repair kit";
		Lang.txt[1][291] = "Hint: Press 5 to use\n";
		Lang.txt[1][292] = "Fully restores hull of the tank\n";
		Lang.txt[1][293] = "KPVHMG";
		Lang.txt[1][294] = "KPV heavy machine gun\n";
		Lang.txt[1][295] = "module is\nnot installed";
		Lang.txt[1][296] = "d";
		Lang.txt[1][297] = "h";
		Lang.txt[1][298] = "m";
		Lang.txt[1][299] = "s";
		Lang.txt[1][300] = "Available in tank mode\n";
		Lang.txt[1][301] = "Light tank";
		Lang.txt[1][302] = "Medium tank";
		Lang.txt[1][303] = "Heavy tank";
		Lang.txt[1][304] = " seconds";
		Lang.txt[1][305] = " second";
		Lang.txt[1][306] = " seconds";
		Lang.txt[1][307] = "Round will start in ";
		Lang.txt[1][308] = "Floor ";
		Lang.txt[1][309] = "10 seconds until evacuation!\nPlease enter the elevator.";
		Lang.txt[1][310] = "Explosion in 30 seconds.";
		Lang.txt[1][311] = "Stage cleared!\n60 seconds to leave the floor.";
		Lang.txt[1][312] = "Defeat!!!\nYou died!";
		Lang.txt[1][313] = "Congratulations!!!\nYou won!";
		Lang.txt[1][314] = "Leave the elevator!!!\nYou have 10 seconds!";
		Lang.txt[1][315] = "TNT HAS BEEN PLANTED!\n10 seconds before the explosion!";
		Lang.txt[1][316] = "RESTART AFTER 5 SECONDS!";
		Lang.txt[1][317] = "ASSAULT WILL START IN ";
		Lang.txt[1][318] = "THE ASSAULT BEGINS!";
		Lang.txt[1][319] = "THE FIRST BLOCKLINE HAS BEEN DESTROYED";
		Lang.txt[1][320] = "HEADQUARTERS HAS BEEN DESTROYED! BLUE TEAM WINS!";
		Lang.txt[1][321] = "TIME IS OUT! RED TEAM WINS!";
		Lang.txt[1][322] = "BLUE TEAM IS DEFEATED!\nRED TEAM WINS!";
		Lang.txt[1][323] = "RED TEAM IS DEFEATED!\nBLUE TEAM WINS!";
		Lang.txt[1][324] = "WAITING FOR THE OTHER PLAYERS!";
		Lang.txt[1][325] = "THE RED REINFORCEMENTS ARRIVES IN 30 SECONDS!";
		Lang.txt[1][326] = "THE RED REINFORCEMENTS ARRIVES IN 20 SECONDS!";
		Lang.txt[1][327] = "THE RED REINFORCEMENTS ARRIVES IN 10 SECONDS!";
		Lang.txt[1][328] = " from 5 TNT's was planted!";
		Lang.txt[1][329] = " before respawn...";
		Lang.txt[1][330] = "CHANGES WILL BE APPLIED\n FROM THE NEXT RESPAWN";
		Lang.txt[1][331] = "Vehicle will be available after ";
		Lang.txt[1][332] = "PLAYERS";
		Lang.txt[1][333] = "CLANS";
		Lang.txt[1][338] = "\nRequired level 6";
		Lang.txt[1][339] = "\nRequired level 13";
		Lang.txt[1][340] = "\nRequired level 21";
		Lang.txt[1][341] = "REQUIRED\nLEVEL ";
		Lang.txt[1][342] = "RUSSIA";
		Lang.txt[1][343] = "EUROPE";
		Lang.txt[1][344] = "USA";
		Lang.txt[1][345] = "CONGRATULATIONS! YOU\nHAVE REACHED LEVEL ";
		Lang.txt[1][346] = "!\nYOUR BONUS:";
		Lang.txt[1][347] = "NEW LEVEL";
		Lang.txt[1][348] = "Battle Mode. Hold center of the map to earn points.";
		Lang.txt[1][349] = "Battle Mode. Points earn only if one team holding\nthe center.";
		Lang.txt[1][350] = "Zombie Mode. Don't stay close to windows,\nbecause zombies can reach you!";
		Lang.txt[1][351] = "Zombie Mode. Stick with groups while playing\nthe people side.";
		Lang.txt[1][352] = "Capture Mode. Your team needs 5000 points to win\nthe match.";
		Lang.txt[1][353] = "Capture Mode. You can not capture spawn territories.";
		Lang.txt[1][354] = "Capture Mode. One captured territory gives\n1 point per 2 seconds.";
		Lang.txt[1][355] = "Versus Mode. Deaths do not affect the points of the match\nFree to die!";
		Lang.txt[1][356] = "Versus Mode. Our map destruction uber-technology\ndo not work in this mode.";
		Lang.txt[1][357] = "Carnage Mode. Using the bat you can liquidate enemy\nwith only one hit, but it's ROF is slower\nthan the other weapons.";
		Lang.txt[1][358] = "Carnage Mode. Sometimes hitting the body is more effective,\nespecially if enemy has a helmet.";
		Lang.txt[1][359] = "Survival Mode. Remember the fact that npc-zombies\ncan not jump. Yet.";
		Lang.txt[1][360] = "Survival Mode. And again, stick with groups.";
		Lang.txt[1][361] = "Tanks Mode. Be aware! Burning tank exploses soon.";
		Lang.txt[1][362] = "Tanks Mode. Cumulative projectiles \"ZBK18M\" effective against tanks,\nwhile HE fragmentation shell \"ZOV26\" - agains infantry.";
		Lang.txt[1][363] = "Fullscreen";
		Lang.txt[1][364] = "Belsnickel";
		Lang.txt[1][365] = "Rabbit boy";
		Lang.txt[1][366] = "Rabbit girl";
		Lang.txt[1][367] = "Winter ";
		Lang.txt[1][368] = "Zombie edition";
		Lang.txt[1][369] = "MERRY CHRISTMAS!";
		Lang.txt[1][370] = "MERRY CHRISTMAS!\nYOUR GIFT ";
		Lang.txt[1][371] = " COIN(S)!\nCONGRATULATIONS!";
		Lang.txt[1][372] = "Protects against two-time hit in the head\n";
		Lang.txt[1][373] = "Reinforced helmet";
		Lang.txt[1][374] = "Reinforced body armor";
		Lang.txt[1][375] = "Elf";
		Lang.txt[1][376] = "Snowman";
		Lang.txt[1][377] = "Santagirl";
		Lang.txt[1][378] = "Santa";
		Lang.txt[1][379] = "Congratulations soldier!\nTake your 20 coin(s)!\nCheck other stuff\nin inventory.";
		Lang.txt[1][380] = "CONGRATULATIONS!";
		Lang.txt[1][381] = "PRE ORDER";
		Lang.txt[1][382] = "RESPAWN ";
		Lang.txt[1][383] = " SECONDS";
		Lang.txt[1][384] = "YOUR ID";
		Lang.txt[1][385] = "MAINTENANCE";
		Lang.txt[1][386] = "THE GAME CURRENTLY\nIS UNDER MAINTENANCE.\nPLEASE, COME BACK LATER";
		Lang.txt[1][387] = "BANNED!";
		Lang.txt[1][388] = "YOU ARE BANNED!";
		Lang.txt[1][389] = "EXIT";
		Lang.txt[1][390] = "ERROR!";
		Lang.txt[1][391] = "AN ERROR\nOCCURRED WHILE\nAUTHORIZATION!\nPLEASE, COME BACK LATER";
		Lang.txt[1][392] = "Anarchist";
		Lang.txt[1][393] = "Rebel";
		Lang.txt[1][394] = "Infantryman";
		Lang.txt[1][395] = "Navy soldier";
		Lang.txt[1][396] = "Air force soldier";
		Lang.txt[1][397] = "HE grenade.\n";
		Lang.txt[1][398] = "Smoke grenade.\n";
		Lang.txt[1][399] = "Cumulative grenade.\n";
		Lang.txt[1][400] = "BLUE";
		Lang.txt[1][401] = "RED";
		Lang.txt[1][402] = "GREEN";
		Lang.txt[1][403] = "YELLOW";
		Lang.txt[1][404] = "SELECT TEAM";
		Lang.txt[1][405] = "TEAM LIST";
		Lang.txt[1][406] = "HUMANS";
		Lang.txt[1][407] = "DEAD";
		Lang.txt[1][408] = "ZOMBIES";
		Lang.txt[1][409] = "AUTO";
		Lang.txt[1][410] = "MELEE";
		Lang.txt[1][411] = "PRIMARY";
		Lang.txt[1][412] = "SECONDARY";
		Lang.txt[1][413] = "AMMUNITION";
		Lang.txt[1][414] = "VEHICLES";
		Lang.txt[1][415] = "DAMAGE";
		Lang.txt[1][416] = "ROF";
		Lang.txt[1][417] = "CLIP";
		Lang.txt[1][418] = "AMMO";
		Lang.txt[1][419] = "DISTANCE";
		Lang.txt[1][420] = "HULL";
		Lang.txt[1][421] = "ARMOR";
		Lang.txt[1][422] = "SPEED";
		Lang.txt[1][423] = "RELOAD";
		Lang.txt[1][424] = "AIMING";
		Lang.txt[1][425] = "SNIPER";
		Lang.txt[1][426] = "ASSAULT";
		Lang.txt[1][427] = "SUPPORT";
		Lang.txt[1][428] = "ARMORY";
		Lang.txt[1][429] = "FIGHT";
		Lang.txt[1][430] = "INFANTRY";
		Lang.txt[1][431] = "EXPLOSIVE";
		Lang.txt[1][432] = "VEHICLES";
		Lang.txt[1][433] = "GRENADES";
		Lang.txt[1][434] = "TANKS";
		Lang.txt[1][435] = "DESCRIPTION";
		Lang.txt[1][436] = "Casper";
		Lang.txt[1][437] = "Jack";
		Lang.txt[1][438] = "Designed to stop\nor deflect bullets";
		Lang.txt[1][439] = "Journalist";
		Lang.txt[1][440] = "Mulatto";
		Lang.txt[1][441] = "Assassin girl";
		Lang.txt[1][442] = "Terrorist girl";
		Lang.txt[1][443] = "THE SERVER LIST\nWILL BE UPDATED\nAFTER ";
		Lang.txt[1][444] = "You need a private tank!";
		Lang.txt[1][445] = "UNBAN $";
		Lang.txt[1][446] = "You don't have a clan!";
		Lang.txt[1][447] = "Clan is full!";
		Lang.txt[1][448] = "Badges";
		Lang.txt[1][449] = "Toxic";
		Lang.txt[1][450] = "British soldier";
		Lang.txt[1][451] = "French soldier";
		Lang.txt[1][452] = "Japanese soldier";
		Lang.txt[1][453] = "US soldier";
		Lang.txt[1][454] = "70 years of WWII";
		Lang.txt[1][455] = "George Ribbon";
		Lang.txt[1][456] = "Flag of Britain";
		Lang.txt[1][457] = "Flag of France";
		Lang.txt[1][458] = "Flag of Germany";
		Lang.txt[1][459] = "Flag of Japan";
		Lang.txt[1][460] = "Flag of Russia";
		Lang.txt[1][461] = "Flag of USA";
		Lang.txt[1][462] = "Flag of USSR";
		Lang.txt[1][463] = "Badge ";
		Lang.txt[1][464] = "Protection against gas grenades\n";
		Lang.txt[1][465] = "AT mine\n";
		Lang.txt[1][466] = "Molotov cocktail\n";
		Lang.txt[1][467] = "M202\n";
		Lang.txt[1][468] = "Gas grenade\n";
		Lang.txt[1][469] = "Armored block\n";
		Lang.txt[1][470] = "Flash\n";
		Lang.txt[1][471] = "Smoke\n";
		Lang.txt[1][472] = "(is temporarily unavailable)";
		Lang.txt[1][473] = "Quantity 1000 pcs\n";
		Lang.txt[1][474] = "Replaces the standard block\n";
		Lang.txt[1][475] = "Quantity 25 pcs\n";
		Lang.txt[1][476] = "Hint: Press H to use\n";
		Lang.txt[1][477] = "Jeep\n";
		Lang.txt[1][478] = "ENTER JEEP";
		Lang.txt[1][479] = "VEHICLE CALL IS UNAVAILABLE\nWHILE JEEP IS BUSY WITH OTHER PLAYERS!";
		Lang.txt[1][480] = "FRIENDS";
		Lang.txt[1][481] = "POSITION";
		Lang.txt[1][482] = "VK NAME";
		Lang.txt[1][483] = "LEVEL";
		Lang.txt[1][484] = "LOADING FRIENDS RATING...";
		Lang.txt[1][485] = "ERROR LOADING FRIENDS RATING.";
		Lang.txt[1][486] = "WITH FRIEND";
		Lang.txt[1][487] = "LOADING FRIENDS LIST...";
		Lang.txt[1][488] = "MEGAPACKS";
		Lang.txt[1][489] = "UNIQUE OFFER!\nAll weapons and vehicles\nin one pack with a discount\nof more than 70%!";
		Lang.txt[1][490] = ": AUTHORIZATION";
		Lang.txt[1][491] = ": DOWNLOAD MAP";
		Lang.txt[1][492] = ": CONSTRUCTION MAP";
		Lang.txt[1][493] = ": VISUALIZATION MAP";
		Lang.txt[1][494] = ": PROFILE LOADING";
		Lang.txt[1][495] = "Only for tanks\npurchased in the store\n";
		Lang.txt[1][496] = "You can un-install it\nby setting the standard skin.\n";
		Lang.txt[1][497] = "\nCAPTURE ALL ENEMY FLAGS!\n";
		Lang.txt[1][498] = "\nPROTECT THE FLAGS AT ANY COST!\n";
		Lang.txt[1][499] = "ALL FLAGS CAPTURED!";
		Lang.txt[1][500] = "\nOPPONENT DROPPED AT THE LAST LINE!\nGET TO THE EXTRACTION POINT!";
		Lang.txt[1][501] = "\nSTOP ENEMY ESCAPE TO GET TO THE POINT!";
		Lang.txt[1][502] = " from 4 flags was captured!";
		Lang.txt[1][503] = " from 50 soldiers was evacuated!";
		Lang.txt[1][504] = "List";
		Lang.txt[1][505] = "BATTLE MAPS";
		Lang.txt[1][506] = "VERSUS MAPS";
		Lang.txt[1][507] = "The first map for free!";
		Lang.txt[1][508] = "Map limit reached!";
		Lang.txt[1][509] = "Congratulations soldier!\nTake your 30 coins\nCheck other stuff\nin inventory.";
		Lang.txt[1][510] = "MERRY CHRISTMAS!";
		Lang.txt[1][511] = "Dracula";
		Lang.txt[1][512] = "Mummy";
		Lang.txt[1][513] = "Werewolf";
		Lang.txt[1][514] = "THE OFFER IS VALID UNTIL ~";
		Lang.txt[1][515] = "CROSSHAIR POINT";
		Lang.txt[1][516] = "CROSSHAIR TYPE";
		Lang.txt[1][517] = "CROSSHAIR COLOR";
		Lang.txt[1][518] = "Alice";
		Lang.txt[1][519] = "Flag of Ukraine";
		Lang.txt[1][520] = "Flag of Belarus";
		Lang.txt[1][521] = "HATS";
		Lang.txt[1][522] = "MASKS";
		Lang.txt[1][523] = "Visual decoration";
		Lang.txt[1][524] = "MELEE";
		Lang.txt[1][525] = "PISTOLS";
		Lang.txt[1][526] = "Sapper";
		Lang.txt[1][527] = "Blockade 3 years";
		Lang.txt[1][528] = "Blockade 6 years";
		Lang.txt[1][529] = "PRESS LEFT MOUSE BUTTON FOR RESPAWN";
		Lang.txt[1][530] = "1. Policy of Administration of the game:\n1.1 Ignorance or misunderstanding of rules does not exempt from liability for their violation.\n1.2 The administration of the game does not guarantee reliable work in provision of services, and also does not bear damage liability which can be caused to users owing to failures in communication lines, wrong use of the provided services, defects of the software and other actions which can lead to emergence of undesirable situations.\n1.3 The administration of the game does not deal with the issues connected with a purchase, sale or issue of accounts, pieces of game stock. You can purchase all available objects through intra game shop.\n1.4 The administration of the game reserves the right orders all game objects on all accounts at discretion.\n1.5 The administration of the game is not engaged in unban of the game accounts, excepting those cases in which bans has occurred because of Administration.\n1.6 Attempt of abuse of regulations can be equated to perfect violation.\n\n2.The administration of game reserves the right:\n2.1 To refuse provision of services without explanation.\n2.2 To estimate actions of users and to inflict any sanctions on them in the cases which are not provided by these rules if considers it necessary.\n2.3 To consider and make decisions according to collective requests from users.\n2.4 To make changes to these rules, without consent of users.\n2.5 To make changes to the game at discretion.\n\n3.Game accounts:\n3.1 Names of characters shall be intelligent, readable and said.\n3.2 The obscene, defiant, offensive or interfering the game process names are forbidden.\n3.3 The owner of the account bears complete responsibility for everything that has been made under his account.\n3.4 Joint use of the accounts, as well as transfer, purchase or sale accounts is forbidden.\n\n4.Game process:\n4.1 It is forbidden to make any actions which can break game process or lead to unstable operation of game servers. Concealment of information on such actions is also forbidden.\n4.2 Curses, obscene expressions, insults, threats, racketing, blackmail, sexual harassments, kindling of ethnic, interclass or interracial strife and etc., etc. are forbidden.\n4.3 It is forbidden to issue itself for Administration of game.\n4.4 It is forbidden to require from other players information which they consider confidential.Begging of passwords, phone numbers and any other information allowing to get access to the game account is forbidden.\n4.5 The disrespectful appeal to Administration of game is forbidden.Contest of actions of Administration is allowed only through technical support of game.\n4.6 Blooming of rumors, misinformation about Administration of game, as well as about other players is forbidden.\n4.7 It is forbidden to beg, exasperate with requests Administration of game.\n4.8 Flood and spam, advertizing and an anti - advertizing is forbidden.\n4.9 Any kinds of fraud are forbidden.\n4.10 Use of the programs or any other additional resources giving to the player advantage over other players is forbidden (Chita, khaki, bugs, modifications for browsers, special browsers, a high ping).\n4.11 Pumping game characters(botovodstvo) is forbidden.\n4.12 It is only authorized to write about game defects technical support games.\n\n5.Communication with Administration of game.\n5.1 It is recommended to ask questions only to technical support of game through personal messages. Information on agents of technical support of game is specified in contacts of official group of game.\n5.2 In case of communication with Administration of game the player shall briefly, distinctly and without use of a slang to tell about the problem or to answer the questions asked by the Administrator.\n5.3 It is forbidden to ask the Administrator to make something that does not belong to his duties.\n5.4 In case of answers to questions of the Administrator concealment of information, lie, false representation is forbidden.\n5.5 It is forbidden to call the Administrator on the server without the reason, to create obstacles and to distract the Administrator from accomplishment of obligations.\n5.6 The administrator does not answer questions on game process.For this purpose there is an official group of game.\n\n6.In case of loss of game accounts, objects:\n6.1 If it has occurred owing to breaking of protection or an internal error of the server that the Administration whenever possible returns things to victims.\n6.2 In case of violation of the points 3.4, 4.9, 4.10 Administration of Responsibility does not bear.\n\n7. In case of game abuse of regulations, the Administration of game can apply the following sanctions to game accounts of violators:\n7.1 Complete or partial zeroing of the account - Removal of all objects, zeroing of statistics and other.\n7.2 Bang of the account - temporary or fixed blocking of the account.\n7.3 Kickback of the account - return of the account to a certain condition before the player has violated rules.\n7.4 Other actions limiting possibilities of the player.";
		Lang.txt[1][531] = "RULES";
		Lang.txt[1][532] = "BACK";
		Lang.txt[1][533] = "CHAT FILTER";
		Lang.txt[1][534] = "CONGRATULATIONS SOLDIER!";
		Lang.txt[1][535] = "YOU SUCCESSFULLY\nCOMPLETING QUEST!\nYOUR REWARD:\nSCORPION";
		Lang.txt[1][536] = " COIN(S)!\nALSO, IN YOUR INVENTORY YOU WILL FIND A LITTLE SURPRISE!\nCONGRATULATIONS!";
		Lang.txt[1][537] = "HALLOWEEN";
		Lang.txt[1][538] = "NEW YEAR";
		Lang.txt[1][539] = "SNOWBALLS";
		Lang.txt[1][540] = "ATTENTION!\nPut on New Year's thematic skin!";
		Lang.txt[1][541] = "STATISTICS";
		Lang.txt[1][542] = "HALL OF FAME";
		Lang.txt[1][543] = "Silent assassin";
		Lang.txt[1][544] = "Grinch";
		Lang.txt[1][545] = "CONGRATULATIONS, SOLDIER!";
		Lang.txt[1][546] = "YOU HAVE SUCCESSFULLY COMPLETED\nCHRISTMAS ADVENTURE 2018!\nYOU HAVE RECEIVED\nA SNOW WEAPONS PACK, SPECIAL\nAWARD IN HALL OF FAME,\nAND ADDITIONAL\nEQUIPMENT";
		string[] array7 = Lang.txt[1];
		int num7 = 546;
		array7[num7] += " AND BONUS 50 COINS!";
		Lang.txt[1][547] = "YOU HAVE NO AWARDS YET!";
		Lang.txt[1][548] = "CHRISTMAS ADVENTURE 2017";
		Lang.txt[1][549] = "THIS AWARD SIGNIFIES\nTHAT ITS OWNER HAS SUCCESSFULLY COMPLETED\nВ CHRISTMAS ADVENTURE 2017.\n\n\nAWARD VALUE: 5000  EXP.";
		Lang.txt[1][550] = "YOU HAVE SUCCESSFULLY COMPLETED\nCHRISTMAS ADVENTURE 2018!\nYOU HAVE RECEIVED A SNOW WEAPONS PACK,\nSPECIAL  AWARD IN HALL OF FAME AND\nADDITIONAL EQUIPMENT";
		string[] array8 = Lang.txt[1];
		int num8 = 550;
		array8[num8] += " AND BONUS 50 COINS!";
		Lang.txt[1][551] = "MAP SIZE";
		Lang.txt[1][552] = "LARGE";
		Lang.txt[1][553] = "MEDIUM";
		Lang.txt[1][554] = "SMALL";
		Lang.txt[1][555] = "VICTORY DAY";
		Lang.txt[1][556] = "ZOMBIE";
		Lang.txt[1][557] = "GHOST";
		Lang.txt[1][558] = "BOSS";
		Lang.txt[1][559] = "Assassin";
		Lang.txt[1][560] = "Harley";
		Lang.txt[1][561] = "It";
		Lang.txt[1][562] = "Joker";
		Lang.txt[1][563] = "Saw";
		Lang.txt[1][564] = "Scarecrow";
		Lang.txt[1][565] = "Scientist";
		Lang.txt[1][566] = "Skeleton";
		Lang.txt[1][569] = "Archer";
		Lang.txt[1][570] = "Duke";
		Lang.txt[1][571] = "Engineer";
		Lang.txt[1][572] = "Kestrel";
		Lang.txt[1][573] = "Security";
		Lang.txt[1][574] = "CHRISTMAS ADVENTURE 2018";
		Lang.txt[1][575] = "THIS AWARD SIGNIFIES\nTHAT ITS OWNER HAS SUCCESSFULLY COMPLETED\nВ CHRISTMAS ADVENTURE 2018.\n\n\nAWARD VALUE: 5000  EXP.";
		Lang.txt[1][576] = "PISTOLS";
		Lang.txt[1][577] = "SUBMACHINE GUNS";
		Lang.txt[1][578] = "AUTOMATIC WEAPONS";
		Lang.txt[1][579] = "MACHINE GUNS";
		Lang.txt[1][580] = "SNIPER RIFLE";
		Lang.txt[1][581] = "SHOTGUNS";
		Lang.txt[1][582] = "STEEL ARMS";
		Lang.txt[1][583] = "REST";
		Lang.txt[1][584] = "TRACKED VEHICLES";
		Lang.txt[1][585] = "WHEELED VEHICLES";
		Lang.txt[1][586] = "AIRCRAFT";
		Lang.txt[1][587] = "HELICOPTERS";
		Lang.txt[1][588] = "BOATS";
		Lang.txt[1][589] = "CHARACTER SKINS";
		Lang.txt[1][590] = "VEHICLE SKINS";
		Lang.txt[1][591] = "BAGES";
		Lang.txt[1][592] = "HATS";
		Lang.txt[1][593] = "ARMOR";
		Lang.txt[1][594] = "MEDICINE";
		Lang.txt[1][595] = "GRANATES";
		Lang.txt[1][596] = "LAUNCHERS";
		Lang.txt[1][597] = "EXPLOSIVES";
		Lang.txt[1][598] = "BARRICADES";
		Lang.txt[1][599] = "PRESENTS";
		Lang.txt[1][600] = "PREMIUM";
		Lang.txt[1][601] = "MODES";
		Lang.txt[1][602] = "MAPS";
		Lang.txt[1][603] = "CLAN";
		Lang.txt[1][604] = "MEGAPACKS";
		Lang.txt[1][605] = "OTHERS";
		Lang.txt[1][606] = "VEHICLES AMMO";
		Lang.txt[1][621] = "STANDART";
		Lang.txt[1][622] = "LADY EDITION";
		Lang.txt[1][623] = "ZOMBIE EDITION";
		Lang.txt[1][624] = "WWII EDITION";
		Lang.txt[1][625] = "NEW YEAR!";
		Lang.txt[1][626] = "HALLOWEEN";
		Lang.txt[1][641] = "International Day of Human Space Flight!";
		Lang.txt[1][642] = "APRIL 12";
		Lang.txt[1][643] = "KILL <color=yellow>{0}</color> ENEMY PLAYERS USING ANY <color=yellow>MACHINE-GUN</color>";
		Lang.txt[1][644] = "KILL <color=yellow>{0}</color> ENEMY PLAYERS USING ANY <color=yellow>SNIPER RIFLE</color>";
		Lang.txt[1][645] = "KILL <color=yellow>{0}</color> ENEMY PLAYERS USING\nANY <color=yellow>MELEE WEAPON</color> IN ANY GAMEMODE,\n<color=yellow>EXCEPT MELEE GAMEMODE</color>";
		Lang.txt[1][646] = "DESTROY <color=yellow>{0}</color> ENEMY PLAYERS USING <color=yellow>TNT</color>, <color=yellow>C4</color> OR <color=yellow>MINES</color>";
		Lang.txt[1][647] = "DESTROY <color=yellow>{0}</color> ENEMY PLAYERS USING <color=yellow>SHMEL</color>, <color=yellow>RPG-7</color>,\n<color=yellow>MORTAR</color> OR <color=yellow>М202</color>";
		Lang.txt[1][648] = "DESTROY <color=yellow>{0}</color> ENEMY PLAYERS USING <color=yellow>M61</color>, <color=yellow>MK3</color> OR <color=yellow>RGK7</color>";
		Lang.txt[1][649] = "KILL <color=yellow>{0}</color> ENEMY PLAYERS USING MOLOTOV COCKTAIL\nOR GAS GRENADE";
		Lang.txt[1][650] = "KILL <color=yellow>{0}</color> ENEMY PLAYERS AT DISTANCE\nAT LEAST <color=yellow>50 BLOCKS</color> USING ANY <color=yellow>SNIPER RIFLE</color>";
		Lang.txt[1][651] = "KILL YOUR <color=yellow>LAST KILLER</color> WITHIN <color=yellow>1 MINUTE</color>.\nTOTAL NUMBER OF VENDETTS - <color=yellow>{0}</color>";
		Lang.txt[1][652] = "MAKE <color=yellow>{0}</color> HEADSHOTS";
		Lang.txt[1][653] = "SHOT OFF <color=yellow>{0}</color> HELMETS";
		Lang.txt[1][654] = "KILL <color=yellow>50</color> ENEMY PLAYERS WITH LEVEL ABOVE YOURS\n(COUNTS AS <color=yellow>10</color> POINTS)\n<color=yellow>OR</color> KILL <color=yellow>{0}</color> ENEMY PLAYERS WITH LEVEL EQUAL OR BELOW YOURS\n(COUNTS AS <color=yellow>1</color> POINT)\n\n(TOTAL <color=yellow>500</color> POINTS NEEDED)";
		Lang.txt[1][656] = "DEAL <color=yellow>{0}</color> DAMAGE <color=yellow>BLUE</color> TEAM";
		Lang.txt[1][657] = "DEAL <color=yellow>{0}</color> DAMAGE <color=yellow>RED</color> TEAM";
		Lang.txt[1][658] = "DEAL <color=yellow>{0}</color> DAMAGE <color=yellow>GREEN</color> TEAM";
		Lang.txt[1][659] = "DEAL <color=yellow>{0}</color> DAMAGE <color=yellow>YELLOW</color> TEAM";
		Lang.txt[1][660] = "KILL <color=yellow>{0}</color> ENEMY PLAYERS USING\n<color=yellow>ANY SUPRESSED WEAPON</color>";
		Lang.txt[1][661] = "GOOD DAY, BRAVE BLOCKADE SOLDIERS!\nWE ARE GLAD TO INTRODUCE TO YOU <color=red>CHRISTMAS ADVENTURE 2018</color>!\nLIGHT UP ALL THE LIGHTS ON THE CHRISTMAS TREE,\nINCLUDING A STAR ON THE TOP BY COMPLETING THE MISSIONS.\nAFTER ALL MISSIONS COMPLETED YOU WILL GET A <color=red>SNOW WEAPONS PACK</color>,\n<color=red>SPECIAL AWARD IN HALL OF FAME</color>, WHICH GIVES\n<color=red>5000</color> EXP FOR THE  PLAYER RANK AND <color=red>ADDITIONAL EQUIPMENT</color>";
		string[] array9 = Lang.txt[1];
		int num9 = 661;
		array9[num9] += "\nAND <color=red>50</color> COINS BONUS!";
		string[] array10 = Lang.txt[1];
		int num10 = 661;
		array10[num10] += "\n\n<b>MISSIONS COMPLETING CONDITIONS</b>:\n- MISSION COMPLETION IN A <color=red>PRIVATE SERVER IS NOT POSSIBLE</color>;\n- MISSION COMPLETION IS POSSIBLE ON A SERVERS WITH\nA NUMBER OF PLAYERS <color=red>AT LEAST 16</color>(EXCEPT SURVIVAL GAMEMODE);\n- PLAYERS WHO <color=red>ABUSE</color> MISSIONS,\nWILL BE <color=red>PUNISHED</color>;\n- ALL MISSIONS ARE COMPLETING <color=red>IN A STRICT SEQUENCE</color>.\nTASKS IN MISSIONS CAN BE COMPLETED AT THE SAME TIME;\n- TO <color=red>COMPLETE</color> CURRENT MISSION <color=red>YOU NEED TO</color>\nOPEN <color=red>CHRISTMAS  ADVENTURE WINDOW</color>\nWHERE YOU WILL SEE <color=red>CONDITIONS OF THE NEXT MISSION</color>.\n\nDEVELOPERS TEAM OF THE GAME <color=red>BLOCKADE</color>\nWISHES YOU <color=red>MARRY CHRISTMAS</color> AND A <color=red>HAPPY NEW YEAR</color>!!!";
		Lang.txt[1][662] = "CHRISTMAS ADVENTURE 2018";
		Lang.txt[1][663] = "AFTER ALL MISSIONS COMPLETED YOU WILL GET\nA <color=red>SNOW WEAPONS PACK</color>,\n<color=red>SPECIAL AWARD IN HALL OF FAME</color>,\n<color=red>ADDITIONAL EQUIMPENT</color>";
		string[] array11 = Lang.txt[1];
		int num11 = 663;
		array11[num11] += " AND <color=red>50</color> BONUS COINS.";
		Lang.txt[1][664] = "AFTER ALL MISSIONS COMPLETED YOU WILL GET\nA <color=red>SNOW WEAPONS PACK</color>,\nSPECIAL AWARD IN HALL OF FAME,\nADDITIONAL EQUIMPENT";
		string[] array12 = Lang.txt[1];
		int num12 = 664;
		array12[num12] += " AND 50 BONUS COINS.";
		Lang.txt[1][665] = "^3NOVALINK ANTICHEAT^8: PLAYER";
		Lang.txt[1][666] = "  ^8BANNED FOR CHEATING!";
		Lang.txt[1][700] = "Can be useful to check the corners.";
		Lang.txt[1][701] = "Legendary weapon.";
		Lang.txt[1][702] = "Why does this weapon have so weird shooting sound?";
		Lang.txt[1][703] = "For those who like chrome plated weapons.";
		Lang.txt[1][704] = "If you feel too lazy to aim.";
		Lang.txt[1][705] = "Used by Spetsnaz guys.";
		Lang.txt[1][706] = "Very compact rifle.";
		Lang.txt[1][707] = "Good things come in small packages.";
		Lang.txt[1][708] = "Classic? Here it is!";
		Lang.txt[1][709] = "Handheld beast.";
		Lang.txt[1][710] = "A good reason to stay alive in an intimate conversations.";
		Lang.txt[1][711] = "Everyone complaining to remove that one, same time keep playing with it.";
		Lang.txt[1][712] = "Spetsnaz sniper rifle.";
		Lang.txt[1][713] = "Medkit for small scratches.";
		Lang.txt[1][714] = "Medkit for medium bones fracture.";
		Lang.txt[1][715] = "Medkit for large bulletholes.";
		Lang.txt[1][716] = "Silent assassin.";
		Lang.txt[1][717] = "Every single bullet helps.";
		Lang.txt[1][718] = "From a small spark a great fire ensues.";
		Lang.txt[1][719] = "Prison shank , who has carried it to the game?";
		Lang.txt[1][720] = "Take in a fire situation , well, or if you want  to teach someone.";
		Lang.txt[1][721] = "Baseball, but using heads instead of the balls.";
		Lang.txt[1][722] = "Break the blocks? Easily! Breaking opponent's bones? No problems!";
		Lang.txt[1][723] = "Tasty sucking-stick!";
		Lang.txt[1][724] = "Usual block. It's just explosive , and quite fun.";
		Lang.txt[1][725] = "Its production was so large so that they handed out free of charge. But then its deliveries sharply declined. How Come? No one knows.";
		Lang.txt[1][726] = "If you want an optical sight, but do not want the sniper rifle.";
		Lang.txt[1][727] = "Mortar shooting with boiling kettles, as you can hear.";
		Lang.txt[1][728] = "Custom version of the classic M14.";
		Lang.txt[1][729] = "Able to turn off even the elephant.";
		Lang.txt[1][730] = "The new star among the class of shotguns .";
		Lang.txt[1][731] = "How the hell do they carry it in the hands?";
		Lang.txt[1][732] = "For lovers of classic, at the same time for the real risk kids !";
		Lang.txt[1][733] = "Leave the scars on the opponents' faces.";
		Lang.txt[1][734] = "For quiet showdown.";
		Lang.txt[1][735] = "'I fly away, exploding on contact with anything.' - that what was written in the order.";
		Lang.txt[1][736] = "Smugglers brought them so much that they were giving away free .";
		Lang.txt[1][737] = "'You can charge them special grenades.' - that what was written in the order.";
		Lang.txt[1][738] = "'You can charge them special grenades too.' - that what was written in the order.";
		Lang.txt[1][739] = "This is only a tool. I'm the actual weapon.";
		Lang.txt[1][740] = "When you want to make your own Armageddon !";
		Lang.txt[1][741] = "This rifle was brought straight from the last century.";
		Lang.txt[1][742] = "This little beast was brought straight from the last century.";
		Lang.txt[1][743] = "This exotic weapon was brought straight from the last century.";
		Lang.txt[1][744] = "Small, compact and lightweight so that it can be reloaded just in a 1 second.";
		Lang.txt[1][745] = "Large, uncomfortable, but it is so lightweight that it can be reloaded just in a 1 second.";
		Lang.txt[1][746] = "Italian passion, it's a pity you can not take immediately tow of them. Wait, can you?";
		Lang.txt[1][747] = "Everything pops, everything crackles this is we make our way through the jungle. People jungle.";
		Lang.txt[1][748] = "You have a tank? I have an RPG7.";
		Lang.txt[1][749] = "This is actually a drum stick, which you have to beat the tanks.";
		Lang.txt[1][750] = "Strange weapon. Looks like a rifle, but it's a shotgun.";
		Lang.txt[1][751] = "Weapon for real spies.";
		Lang.txt[1][752] = "Weird shaped weapon. A gift from the aliens?";
		Lang.txt[1][753] = "Pride of the nation.";
		Lang.txt[1][754] = "It would be fun if I had two of this babies, plus the ability to slow down the time. Well, it's a bad idea.";
		Lang.txt[1][755] = "Serious argument in the dispute who should live and who should die.";
		Lang.txt[1][756] = "Cheeki-breeki iv damke!";
		Lang.txt[1][757] = "Modern, comfortable and deadly. What else you need to be completely happy?";
		Lang.txt[1][758] = "Compact submachine gun.";
		Lang.txt[1][759] = "Is it player with the NTW 20 or 20 NTW with the player in it's hand?";
		Lang.txt[1][760] = "Camouflage? Are you kidding? Also damage? Now it is clear.";
		Lang.txt[1][761] = "Solution for disputes between the tanks.";
		Lang.txt[1][762] = "A huge solution for disputes between tanks and infantry. In favor of the first one.";
		Lang.txt[1][763] = "Second wind for the dying tank.";
		Lang.txt[1][764] = "A solution for disputes between tanks and infantry. In favor of the first one.";
		Lang.txt[1][765] = "Feel like a hero of the fantastic movie!";
		Lang.txt[1][766] = "This is a homing missle. It capable to destroy a tank in 1 secound. If it were any smarter, it'd write a book. It would read it to you.";
		Lang.txt[1][767] = "Smaller but quicker.";
		Lang.txt[1][768] = "Balance is needed in everything.";
		Lang.txt[1][769] = "Larger, but slower.";
		Lang.txt[1][770] = "Strange weapon. Looks like a rifle, but it's a shotgun. Version designed specifically against zombies. They feel bad when they see this terrible painting.";
		Lang.txt[1][771] = "Used by Spetsnaz guys. Version designed specifically against zombies. They feel bad when they see this terrible painting.";
		Lang.txt[1][772] = "Weapon for real spies. Version designed specifically against zombies. They feel bad when they see this terrible painting.";
		Lang.txt[1][773] = "How the hell do they carry it in the hands? Version designed specifically against zombies. They feel bad when they see this terrible painting.";
		Lang.txt[1][774] = "Handheld beast. Version designed specifically against zombies. They feel bad when they see this terrible painting.";
		Lang.txt[1][775] = "Feel like a hero of the fantastic movie! Version designed specifically against zombies. They feel bad when they see this terrible painting.";
		Lang.txt[1][776] = "A good reason to stay alive in an intimate conversations. Version designed specifically against zombies. They feel bad when they see this terrible painting.";
		Lang.txt[1][777] = "Third chance does not hurt.";
		Lang.txt[1][778] = "They are quite warm. Do they have the insulation feature?";
		Lang.txt[1][779] = "Whom to break a bo... I mean, replace the pipe?";
		Lang.txt[1][780] = "Medieval cruelty.";
		Lang.txt[1][781] = "Is able to cut opponent's head into two equal parts with a jeweler's precision.";
		Lang.txt[1][782] = "This pistol was brought straight from the last century.";
		Lang.txt[1][783] = "Fact: this weapon can kill someone standing on the opposite side of the map.";
		Lang.txt[1][784] = "Pretty qualitative weapon.";
		Lang.txt[1][785] = "It is better not to use in small spaces. The consequences will be fatal.";
		Lang.txt[1][786] = "They don't see you, you don't see anything. But it smells so good.";
		Lang.txt[1][787] = "Able to incapacitate the enemy vehicle . If you can throw it, of course.";
		Lang.txt[1][788] = "Few people know, but mine can be buried under the ground!";
		Lang.txt[1][789] = "Left click - tick-tick, right click- kaboom.";
		Lang.txt[1][790] = "Found a butcher's knife, where can I get the hook now?";
		Lang.txt[1][791] = "You can arrange a Spartan competition.";
		Lang.txt[1][792] = "The younger brother of the legend.";
		Lang.txt[1][793] = "Did you tell that you will to shoot at flies? I doubt it.";
		Lang.txt[1][794] = "Weapon for real authorities.";
		Lang.txt[1][795] = "In case of important excavations.";
		Lang.txt[1][796] = "An unique weapon invented by the developers of the game.";
		Lang.txt[1][797] = "Standard. There are players who need only this weapon.";
		Lang.txt[1][798] = "Some players call this weapon 'carrot'. Why would they?";
		Lang.txt[1][799] = "Soviet machine gun of the WW2.";
		Lang.txt[1][800] = "French machine gun of the WW2.";
		Lang.txt[1][801] = "German machine gun of the WW2.";
		Lang.txt[1][802] = "British submachine gun of the WW2.";
		Lang.txt[1][803] = "US submachine gun of the WW2.";
		Lang.txt[1][804] = "Japanese machine gun of the WW2.";
		Lang.txt[1][805] = "Standard shotgun. Able to kill with a single shot at close range.";
		Lang.txt[1][806] = "Standard gun. You can dig up a hole in the head of the enemy.";
		Lang.txt[1][807] = "4-barreled rocket launcher. Able to release 4 missiles.";
		Lang.txt[1][808] = "AT mine. Able to destroy vehicles and tanks.";
		Lang.txt[1][809] = "Napalm which makes enemy's one place be burnt. Causes damage over time.";
		Lang.txt[1][810] = "This kind of toxins brews a professor known as 'Toxik'.";
		Lang.txt[1][811] = "4-wheeled fun with an on-board machinegun.";
		Lang.txt[1][812] = "The only way to hurt somebody with a food in the game.";
		Lang.txt[1][813] = "The legacy of the sons of two legendary weapon makers.";
		Lang.txt[1][814] = "Thunderstorm. It has a built-in grenade launcher.";
		Lang.txt[1][815] = "Currently there is only one workable copy. It's in the Blockade.";
		Lang.txt[1][816] = "Timber! Timber! Heads! Bodies!";
		Lang.txt[1][817] = "H&K PSG-1. Very accurate, reliable gun with a high rate of fire.";
		Lang.txt[1][818] = "Krytac LMG. Does it even exist?";
		Lang.txt[1][819] = "Special forces weapon.";
		Lang.txt[1][820] = "Dual Golden Colts. Just like in action films!";
		Lang.txt[1][821] = "The gun with the size of a lady's handbag and a stunning knockdown.";
		Lang.txt[1][822] = "Czech special automatic pistol designed for tank operators, communication operators and other soldiers.";
		Lang.txt[1][823] = "A modern ambassador of folding submachine guns.";
		Lang.txt[1][824] = "Hunting carbine-shotgun based on the legendary assault rifle.";
		Lang.txt[1][825] = "A great weapon for fans of setting someone a fire.";
		Lang.txt[1][826] = "LANGUAGE";
		Lang.txt[1][827] = " - IN GAME";
		Lang.txt[1][828] = " - SET";
		Lang.txt[1][830] = "BATTLE";
		Lang.txt[1][831] = "ALPHA";
		Lang.txt[1][832] = "BUILD";
		Lang.txt[1][833] = "ZOMBIE";
		Lang.txt[1][834] = "CAPTURE";
		Lang.txt[1][835] = "CONTRA";
		Lang.txt[1][836] = "MELEE";
		Lang.txt[1][837] = "SURVIVAL";
		Lang.txt[1][838] = "1945";
		Lang.txt[1][839] = "PRORIV";
		Lang.txt[1][840] = "CLEAR";
		Lang.txt[1][841] = "TANKS";
		Lang.txt[1][842] = "SNOWBALLS";
		Lang.txt[1][843] = "DOMINATION";
		Lang.txt[1][850] = "NO FRIENDS IN THE GAME...";
		Lang.txt[1][855] = "ACTIONS";
		Lang.txt[1][856] = "COINS";
		Lang.txt[1][857] = "HISTORY";
		Lang.txt[1][860] = "ALL WEAPONS PACK";
		Lang.txt[1][861] = "CONFIRMED";
		Lang.txt[1][862] = "CANCELED";
		Lang.txt[1][863] = "UPDATE";
		Lang.txt[1][864] = "DATE";
		Lang.txt[1][865] = "PURCHASE";
		Lang.txt[1][866] = "COST";
		Lang.txt[1][867] = "STATUS";
		Lang.txt[1][868] = "LOADING HISTORY...";
		Lang.txt[1][869] = "UPDATING...";
		Lang.txt[1][870] = "SHOWING CANCELED TRANSACTIONS";
		Lang.txt[1][871] = "TRANSACTIONS NOT FOUND!";
		Lang.txt[1][872] = "VICTORY DAY!";
		Lang.txt[1][873] = "Congratulations soldier!\nTake your 20 coins\nCheck other stuff\nin inventory.";
		Lang.txt[1][874] = " KARTRIDGE NOT LAUNCHED!";
		Lang.txt[1][875] = " NOVALINK NOT LAUNCHED!";
		Lang.txt[1][876] = " STEAM NOT LAUNCHED!";
		Lang.txt[1][877] = " You must be logged in to the Kartridge client.";
	}

	// Token: 0x06000190 RID: 400 RVA: 0x00021710 File Offset: 0x0001F910
	public static string GetLabel(int id)
	{
		if (Lang.txt == null)
		{
			return "";
		}
		if (Lang.txt.Length <= Lang.current)
		{
			return "";
		}
		if (Lang.txt[Lang.current] == null)
		{
			return "";
		}
		if (id < 0 || Lang.txt[Lang.current].Length <= id)
		{
			return "";
		}
		return Lang.txt[Lang.current][id];
	}

	// Token: 0x06000191 RID: 401 RVA: 0x00021778 File Offset: 0x0001F978
	public static string GetMapName(int map_id)
	{
		if (Lang.current == 1)
		{
			if (map_id == 0)
			{
				return "PLANE";
			}
			if (map_id == 1)
			{
				return "CITADEL";
			}
			if (map_id == 2)
			{
				return "CASTLE";
			}
			if (map_id == 3)
			{
				return "FORTPOST 2";
			}
			if (map_id == 4)
			{
				return "HILLS";
			}
			if (map_id == 5)
			{
				return "VILLAGE 2";
			}
			if (map_id == 6)
			{
				return "ISLAND";
			}
			if (map_id == 7)
			{
				return "CATHEDRAL 2";
			}
			if (map_id == 8)
			{
				return "TOWN";
			}
			if (map_id == 9)
			{
				return "TECHNO";
			}
			if (map_id == 10)
			{
				return "EMIDRIS";
			}
			if (map_id == 11)
			{
				return "SLIME";
			}
			if (map_id == 12)
			{
				return "CAPITAL";
			}
			if (map_id == 13)
			{
				return "BREST FORTRESS";
			}
			if (map_id == 14)
			{
				return "SWIRL";
			}
			if (map_id == 15)
			{
				return "PRIPYAT";
			}
			if (map_id == 16)
			{
				return "PRIPYAT 2";
			}
			if (map_id == 17)
			{
				return "KLAZMOS";
			}
			if (map_id == 18)
			{
				return "EAST";
			}
			if (map_id == 19)
			{
				return "EPIC";
			}
			if (map_id == 20)
			{
				return "TOWERS";
			}
			if (map_id == 21)
			{
				return "PARK";
			}
			if (map_id == 22)
			{
				return "WINTER GARDEN";
			}
			if (map_id == 23)
			{
				return "HOSTEL";
			}
			if (map_id == 24)
			{
				return "TEMPLE";
			}
			if (map_id == 25)
			{
				return "HASHER";
			}
			if (map_id == 26)
			{
				return "HARBOR";
			}
			if (map_id == 27)
			{
				return "JUNGLE";
			}
			if (map_id == 28)
			{
				return "SECRET BASE";
			}
			if (map_id == 29)
			{
				return "FOREST LAKE";
			}
			if (map_id == 30)
			{
				return "TOWER";
			}
			if (map_id == 31)
			{
				return "JAPAN";
			}
			if (map_id == 32)
			{
				return "UNDERGROUND";
			}
			if (map_id == 33)
			{
				return "ASYLUM";
			}
			if (map_id == 34)
			{
				return "STAR";
			}
			if (map_id == 35)
			{
				return "TOURNAMENT BATTLE";
			}
			if (map_id == 36)
			{
				return "CITY-17";
			}
			if (map_id == 37)
			{
				return "SIEGE";
			}
			if (map_id == 38)
			{
				return "SIBERIA";
			}
			if (map_id == 39)
			{
				return "DEAD CITY";
			}
			if (map_id == 40)
			{
				return "WINTER CASTLE";
			}
			if (map_id == 41)
			{
				return "ISLANDS 2017";
			}
			if (map_id == 42)
			{
				return "FORPOST 3";
			}
			if (map_id == 43)
			{
				return "CHERNOBYL STATION";
			}
			if (map_id == 42)
			{
				return "VILLAGE";
			}
			if (map_id == 43)
			{
				return "CATHEDRAL";
			}
			if (map_id == 44)
			{
				return "WINTER CASTLE";
			}
			if (map_id == 45)
			{
				return "BUBBLES";
			}
			if (map_id == 46)
			{
				return "HAMLET";
			}
			if (map_id == 47)
			{
				return "FOREST CASTLE";
			}
			if (map_id == 48)
			{
				return "NEW CITY";
			}
			if (map_id == 49)
			{
				return "AZTEC";
			}
			if (map_id == 50)
			{
				return "FORTPOST";
			}
			if (map_id == 51)
			{
				return "WINTER CITADEL";
			}
			if (map_id == 52)
			{
				return "OLD CITADEL";
			}
			if (map_id == 101)
			{
				return "CITADEL";
			}
			if (map_id == 102)
			{
				return "CASTLE";
			}
			if (map_id == 103)
			{
				return "FORTPOST";
			}
			if (map_id == 104)
			{
				return "HILLS";
			}
			if (map_id == 105)
			{
				return "VILLAGE";
			}
			if (map_id == 106)
			{
				return "ISLAND";
			}
			if (map_id == 107)
			{
				return "UNDERGROUND";
			}
			if (map_id == 108)
			{
				return "CATHEDRAL";
			}
			if (map_id == 109)
			{
				return "WINTER CASTLE";
			}
			if (map_id == 110)
			{
				return "ASYLUM";
			}
			if (map_id == 111)
			{
				return "TOWN";
			}
			if (map_id == 401)
			{
				return "SQUARE";
			}
			if (map_id == 402)
			{
				return "SHADOW OF BLOCKADE";
			}
			if (map_id == 403)
			{
				return "WINTER FIGHT";
			}
			if (map_id == 404)
			{
				return "ARCHIPELAGO";
			}
			if (map_id == 405)
			{
				return "LOST";
			}
			if (map_id == 406)
			{
				return "VENICE";
			}
			if (map_id == 407)
			{
				return "COUNTRY HOUSE";
			}
			if (map_id == 408)
			{
				return "TOWER";
			}
			if (map_id == 501)
			{
				return "DUST 2";
			}
			if (map_id == 502)
			{
				return "INFERNO";
			}
			if (map_id == 503)
			{
				return "TRAIN";
			}
			if (map_id == 504)
			{
				return "AZTEC";
			}
			if (map_id == 505)
			{
				return "NUKE";
			}
			if (map_id == 506)
			{
				return "OFFICE";
			}
			if (map_id == 507)
			{
				return "CLANMILL";
			}
			if (map_id == 508)
			{
				return "DUST 1";
			}
			if (map_id == 509)
			{
				return "MANSION";
			}
			if (map_id == 510)
			{
				return "FLY 2";
			}
			if (map_id == 511)
			{
				return "TUSCAN";
			}
			if (map_id == 512)
			{
				return "DUST 2002";
			}
			if (map_id == 513)
			{
				return "MINIDUST";
			}
			if (map_id == 514)
			{
				return "POOL";
			}
			if (map_id == 515)
			{
				return "CROSSROADS";
			}
			if (map_id == 516)
			{
				return "RIVER";
			}
			if (map_id == 517)
			{
				return "DESERT BASE";
			}
			if (map_id == 518)
			{
				return "STATION";
			}
			if (map_id == 519)
			{
				return "DUST";
			}
			if (map_id == 520)
			{
				return "MONO";
			}
			if (map_id == 521)
			{
				return "ANTHILL";
			}
			if (map_id == 522)
			{
				return "ASYLUM 2";
			}
			if (map_id == 523)
			{
				return "LAB";
			}
			if (map_id == 524)
			{
				return "QUARTER";
			}
			if (map_id == 525)
			{
				return "INDIA";
			}
			if (map_id == 526)
			{
				return "MINIDUST 2";
			}
			if (map_id == 527)
			{
				return "CBBLE";
			}
			if (map_id == 528)
			{
				return "RED";
			}
			if (map_id == 529)
			{
				return "AZTERIAL";
			}
			if (map_id == 530)
			{
				return "FACTORY";
			}
			if (map_id == 531)
			{
				return "WAREHOUSE";
			}
			if (map_id == 532)
			{
				return "BUSINESS CENTER";
			}
			if (map_id == 533)
			{
				return "TOWERS";
			}
			if (map_id == 534)
			{
				return "CAMP";
			}
			if (map_id == 535)
			{
				return "ASSAULT";
			}
			if (map_id == 536)
			{
				return "TERMINAL";
			}
			if (map_id == 537)
			{
				return "CHEMLAB";
			}
			if (map_id == 538)
			{
				return "METRO";
			}
			if (map_id == 539)
			{
				return "TRENCH";
			}
			if (map_id == 540)
			{
				return "RUINS";
			}
			if (map_id == 541)
			{
				return "CANALIZATION";
			}
			if (map_id == 542)
			{
				return "LUXVILL";
			}
			if (map_id == 543)
			{
				return "RAILWAY STATION";
			}
			if (map_id == 544)
			{
				return "ITALY";
			}
			if (map_id == 545)
			{
				return "TOURNAMENT CONTRA";
			}
			if (map_id == 546)
			{
				return "SUBWAY1337";
			}
			if (map_id == 547)
			{
				return "HANGAR";
			}
			if (map_id == 548)
			{
				return "2013";
			}
			if (map_id == 549)
			{
				return "BERLIN";
			}
			if (map_id == 550)
			{
				return "DEBRIS";
			}
			if (map_id == 551)
			{
				return "FACE";
			}
			if (map_id == 552)
			{
				return "CACHE";
			}
			if (map_id == 553)
			{
				return "ARENA";
			}
			if (map_id == 554)
			{
				return "BACKSTREET";
			}
			if (map_id == 555)
			{
				return "RUINS 2017";
			}
			if (map_id == 556)
			{
				return "STORM";
			}
			if (map_id == 557)
			{
				return "ADRENALIN";
			}
			if (map_id == 558)
			{
				return "WINTER FACTORY";
			}
			if (map_id == 559)
			{
				return "WINTER ASSAULT";
			}
			if (map_id == 560)
			{
				return "WINTER MANSION";
			}
			if (map_id == 561)
			{
				return "WINTER DUST 1";
			}
			if (map_id == 562)
			{
				return "OLD OFFICE";
			}
			if (map_id == 563)
			{
				return "TUSCAN MINI";
			}
			if (map_id == 564)
			{
				return "ARENA MAYA";
			}
			if (map_id == 565)
			{
				return "NEW DUST";
			}
			if (map_id == 566)
			{
				return "CHAIN";
			}
			if (map_id == 567)
			{
				return "CANYON";
			}
			if (map_id == 601)
			{
				return "MINIDUST 2";
			}
			if (map_id == 602)
			{
				return "POOL";
			}
			if (map_id == 603)
			{
				return "CROSSROADS";
			}
			if (map_id == 604)
			{
				return "RIVER";
			}
			if (map_id == 605)
			{
				return "ARENA35";
			}
			if (map_id == 606)
			{
				return "ARENA50";
			}
			if (map_id == 607)
			{
				return "REPOSITORY";
			}
			if (map_id == 608)
			{
				return "INDIA";
			}
			if (map_id == 609)
			{
				return "MADNESS";
			}
			if (map_id == 610)
			{
				return "HUB";
			}
			if (map_id == 611)
			{
				return "RUINS";
			}
			if (map_id == 612)
			{
				return "MINIAZTEC";
			}
			if (map_id == 613)
			{
				return "MASK";
			}
			if (map_id == 614)
			{
				return "75TH";
			}
			if (map_id == 615)
			{
				return "STYLE";
			}
			if (map_id == 616)
			{
				return "FUROR";
			}
			if (map_id == 617)
			{
				return "ARENA MAYA";
			}
			if (map_id == 618)
			{
				return "SHIP";
			}
			if (map_id == 619)
			{
				return "COLD";
			}
			if (map_id == 620)
			{
				return "STRAIGHT";
			}
			if (map_id == 621)
			{
				return "RISK";
			}
			if (map_id == 622)
			{
				return "MINI AZTEC";
			}
			if (map_id == 623)
			{
				return "WILD WEST";
			}
			if (map_id == 624)
			{
				return "RAILWAY STATION";
			}
			if (map_id == 625)
			{
				return "LOOP";
			}
			if (map_id == 626)
			{
				return "MANSION";
			}
			if (map_id == 627)
			{
				return "HANGAR2";
			}
			if (map_id == 628)
			{
				return "COSMO";
			}
			if (map_id == 629)
			{
				return "MONOCHROME";
			}
			if (map_id == 630)
			{
				return "OPISTION";
			}
			if (map_id == 631)
			{
				return "NEFERNO";
			}
			if (map_id == 632)
			{
				return "ZIGZAG";
			}
			if (map_id == 801)
			{
				return "TRENCHES";
			}
			if (map_id == 802)
			{
				return "SURROUND";
			}
			if (map_id == 803)
			{
				return "RUIN";
			}
			if (map_id == 804)
			{
				return "OFFENSIVE";
			}
			if (map_id == 805)
			{
				return "REICHSTAG";
			}
			if (map_id == 901)
			{
				return "BREAKTHROUGH";
			}
			if (map_id == 701)
			{
				return "BEACH";
			}
			if (map_id == 702)
			{
				return "CASTLE";
			}
			if (map_id == 703)
			{
				return "DEFENSE";
			}
			if (map_id == 704)
			{
				return "CITY UMBRELLA";
			}
			if (map_id == 705)
			{
				return "VILLAGE";
			}
			if (map_id == 706)
			{
				return "FORT";
			}
			if (map_id == 707)
			{
				return "ABANDONED CITY";
			}
			if (map_id == 708)
			{
				return "AT THE BALL";
			}
			if (map_id == 709)
			{
				return "DEFENCE";
			}
			if (map_id == 710)
			{
				return "UMBRELLA";
			}
			if (map_id == 711)
			{
				return "HIGHWAY";
			}
			if (map_id == 712)
			{
				return "SURVIVAL";
			}
			if (map_id == 713)
			{
				return "NIGHTMARE NIGHT";
			}
			if (map_id == 714)
			{
				return "SHAPITO";
			}
			if (map_id == 715)
			{
				return "DEAD FARM";
			}
			if (map_id == 716)
			{
				return "HAMLET";
			}
			if (map_id == 717)
			{
				return "INVANSION";
			}
			if (map_id == 1101)
			{
				return "WINTER TOWN";
			}
			if (map_id == 1102)
			{
				return "VALLEY";
			}
			if (map_id == 1103)
			{
				return "WINTER VALLEY";
			}
			if (map_id == 1104)
			{
				return "RIVERTOWN";
			}
			if (map_id == 1105)
			{
				return "SNOWTOWN";
			}
			if (map_id == 1106)
			{
				return "CONFRONTATION";
			}
			if (map_id == 301)
			{
				return "VILLAGE-Z 2";
			}
			if (map_id == 302)
			{
				return "HOUSE";
			}
			if (map_id == 303)
			{
				return "LABYRINTH";
			}
			if (map_id == 304)
			{
				return "MILL";
			}
			if (map_id == 305)
			{
				return "ROCKET";
			}
			if (map_id == 306)
			{
				return "KINGDOM";
			}
			if (map_id == 307)
			{
				return "HOSPITAL";
			}
			if (map_id == 308)
			{
				return "PEACEFUL ATOM";
			}
			if (map_id == 309)
			{
				return "CANALIZATION-Z";
			}
			if (map_id == 310)
			{
				return "TRAP";
			}
			if (map_id == 311)
			{
				return "OLD BUNKER";
			}
			if (map_id == 312)
			{
				return "OLD HOUSE";
			}
			if (map_id == 313)
			{
				return "OLD LABYRINTH";
			}
			if (map_id == 314)
			{
				return "OLD MILL";
			}
			if (map_id == 315)
			{
				return "OLD VILLAGE-Z";
			}
			if (map_id == 316)
			{
				return "OLD ROCKET";
			}
			if (map_id == 317)
			{
				return "BUNKER";
			}
			if (map_id == 1301)
			{
				return "DUST2";
			}
			if (map_id == 1302)
			{
				return "INFERNO";
			}
			if (map_id == 1303)
			{
				return "TRAIN";
			}
			if (map_id == 1304)
			{
				return "NUKE";
			}
			if (map_id == 1305)
			{
				return "OFFICE";
			}
			if (map_id == 1306)
			{
				return "CLANMILL";
			}
			if (map_id == 1307)
			{
				return "DUST1";
			}
			if (map_id == 1308)
			{
				return "FLY2";
			}
			if (map_id == 1309)
			{
				return "CBBLE";
			}
			if (map_id == 1310)
			{
				return "STORM";
			}
			return "MAP#" + map_id.ToString();
		}
		else
		{
			if (map_id == 0)
			{
				return "ПЛОСКОСТЬ";
			}
			if (map_id == 1)
			{
				return "ЦИТАДЕЛЬ";
			}
			if (map_id == 2)
			{
				return "ЗАМОК";
			}
			if (map_id == 3)
			{
				return "ФОРПОСТ 2";
			}
			if (map_id == 4)
			{
				return "ХОЛМЫ";
			}
			if (map_id == 5)
			{
				return "ДЕРЕВНЯ 2";
			}
			if (map_id == 6)
			{
				return "ОСТРОВА";
			}
			if (map_id == 7)
			{
				return "СОБОР 2";
			}
			if (map_id == 8)
			{
				return "ГОРОД";
			}
			if (map_id == 9)
			{
				return "ТЕХНО";
			}
			if (map_id == 10)
			{
				return "ЭМИДРИС";
			}
			if (map_id == 11)
			{
				return "СЛИЗНЯК";
			}
			if (map_id == 12)
			{
				return "СТОЛИЦА";
			}
			if (map_id == 13)
			{
				return "БРЕСТСКАЯ КРЕПОСТЬ";
			}
			if (map_id == 14)
			{
				return "ВОДОВОРОТ";
			}
			if (map_id == 15)
			{
				return "ПРИПЯТЬ";
			}
			if (map_id == 16)
			{
				return "ПРИПЯТЬ 2";
			}
			if (map_id == 17)
			{
				return "КЛАЗМОС";
			}
			if (map_id == 18)
			{
				return "ВОСТОК";
			}
			if (map_id == 19)
			{
				return "ЭПИК";
			}
			if (map_id == 20)
			{
				return "БАШНИ";
			}
			if (map_id == 21)
			{
				return "ПАРК";
			}
			if (map_id == 22)
			{
				return "ЗИМНИЙ САД";
			}
			if (map_id == 23)
			{
				return "ОБЩЕЖИТИЕ";
			}
			if (map_id == 24)
			{
				return "ХРАМ";
			}
			if (map_id == 25)
			{
				return "МЯСОРУБКА";
			}
			if (map_id == 26)
			{
				return "ПОРТ";
			}
			if (map_id == 27)
			{
				return "ДЖУНГЛИ";
			}
			if (map_id == 28)
			{
				return "СЕКРЕТНАЯ БАЗА";
			}
			if (map_id == 29)
			{
				return "ЛЕСНОЕ ОЗЕРО";
			}
			if (map_id == 30)
			{
				return "ВЫШКА";
			}
			if (map_id == 31)
			{
				return "ЯПОНИЯ";
			}
			if (map_id == 32)
			{
				return "ПОДЗЕМКА";
			}
			if (map_id == 33)
			{
				return "УБЕЖИЩЕ";
			}
			if (map_id == 34)
			{
				return "ЗВЕЗДА";
			}
			if (map_id == 35)
			{
				return "ТУРНИРНАЯ БИТВА";
			}
			if (map_id == 36)
			{
				return "СИТИ-17";
			}
			if (map_id == 37)
			{
				return "ОСАДА";
			}
			if (map_id == 38)
			{
				return "СИБИРЬ";
			}
			if (map_id == 39)
			{
				return "МЕРТВЫЙ ГОРОД";
			}
			if (map_id == 40)
			{
				return "ЗИМНИЙ ЗАМОК";
			}
			if (map_id == 41)
			{
				return "ОСТРОВА 2017";
			}
			if (map_id == 42)
			{
				return "ФОРПОСТ 3";
			}
			if (map_id == 43)
			{
				return "ЧАЭС";
			}
			if (map_id == 101)
			{
				return "ЦИТАДЕЛЬ";
			}
			if (map_id == 102)
			{
				return "ЗАМОК";
			}
			if (map_id == 103)
			{
				return "ФОРПОСТ";
			}
			if (map_id == 104)
			{
				return "ХОЛМЫ";
			}
			if (map_id == 105)
			{
				return "ДЕРЕВНЯ";
			}
			if (map_id == 106)
			{
				return "ОСТРОВА";
			}
			if (map_id == 107)
			{
				return "ПОДЗЕМКА";
			}
			if (map_id == 108)
			{
				return "СОБОР";
			}
			if (map_id == 109)
			{
				return "ЗИМНИЙ ЗАМОК";
			}
			if (map_id == 110)
			{
				return "УБЕЖИЩЕ";
			}
			if (map_id == 111)
			{
				return "ГОРОД";
			}
			if (map_id == 42)
			{
				return "ДЕРЕВНЯ";
			}
			if (map_id == 43)
			{
				return "СОБОР";
			}
			if (map_id == 44)
			{
				return "ЗИМНИЙ ЗАМОК";
			}
			if (map_id == 45)
			{
				return "ПУЗЫРИ";
			}
			if (map_id == 46)
			{
				return "СЕЛО";
			}
			if (map_id == 47)
			{
				return "ЛЕСНАЯ КРЕПОСТЬ";
			}
			if (map_id == 48)
			{
				return "НОВЫЙ ГОРОД";
			}
			if (map_id == 49)
			{
				return "АЦТЕК";
			}
			if (map_id == 50)
			{
				return "ФОРПОСТ";
			}
			if (map_id == 51)
			{
				return "ЗИМНЯЯ ЦИТАДЕЛЬ";
			}
			if (map_id == 52)
			{
				return "СТАРАЯ ЦИТАДЕЛЬ";
			}
			if (map_id == 401)
			{
				return "ПЛОЩАДЬ";
			}
			if (map_id == 402)
			{
				return "ТЕНЬ БЛОКАДЫ";
			}
			if (map_id == 403)
			{
				return "ЗИМНИЙ БОЙ";
			}
			if (map_id == 404)
			{
				return "АРХИПЕЛАГ";
			}
			if (map_id == 405)
			{
				return "ЗАТЕРЯННЫЙ";
			}
			if (map_id == 406)
			{
				return "ВЕНЕЦИЯ";
			}
			if (map_id == 407)
			{
				return "ДАЧА";
			}
			if (map_id == 408)
			{
				return "ВЫШКА";
			}
			if (map_id == 501)
			{
				return "ДАСТ2";
			}
			if (map_id == 502)
			{
				return "ИНФЕРНО";
			}
			if (map_id == 503)
			{
				return "ТРЕЙН";
			}
			if (map_id == 504)
			{
				return "АЦТЕК";
			}
			if (map_id == 505)
			{
				return "НЮК";
			}
			if (map_id == 506)
			{
				return "ОФИС";
			}
			if (map_id == 507)
			{
				return "КЛАНМИЛЛ";
			}
			if (map_id == 508)
			{
				return "ДАСТ1";
			}
			if (map_id == 509)
			{
				return "МЭНШЕН";
			}
			if (map_id == 510)
			{
				return "ФЛАЙ2";
			}
			if (map_id == 511)
			{
				return "ТУСКАН";
			}
			if (map_id == 512)
			{
				return "ДАСТ 2002";
			}
			if (map_id == 513)
			{
				return "МИНИДАСТ";
			}
			if (map_id == 514)
			{
				return "БАССЕЙН";
			}
			if (map_id == 515)
			{
				return "ПЕРЕКРЁСТОК";
			}
			if (map_id == 516)
			{
				return "РЕКА";
			}
			if (map_id == 517)
			{
				return "БАЗА В ПУСТЫНЕ";
			}
			if (map_id == 518)
			{
				return "СТАНЦИЯ";
			}
			if (map_id == 519)
			{
				return "ПЫЛЬ";
			}
			if (map_id == 520)
			{
				return "МОНО";
			}
			if (map_id == 521)
			{
				return "МУРАВЕЙНИК";
			}
			if (map_id == 522)
			{
				return "УБЕЖИЩЕ2";
			}
			if (map_id == 523)
			{
				return "ЛАБОРАТОРИЯ";
			}
			if (map_id == 524)
			{
				return "КВАРТАЛ";
			}
			if (map_id == 525)
			{
				return "ИНДИЯ";
			}
			if (map_id == 526)
			{
				return "МИНИДАСТ2";
			}
			if (map_id == 527)
			{
				return "КОБЛ";
			}
			if (map_id == 528)
			{
				return "РЭД";
			}
			if (map_id == 529)
			{
				return "АЦТЕРИАЛ";
			}
			if (map_id == 530)
			{
				return "ФАБРИКА";
			}
			if (map_id == 531)
			{
				return "СКЛАДЫ";
			}
			if (map_id == 532)
			{
				return "ДЕЛОВОЙ ЦЕНТР";
			}
			if (map_id == 533)
			{
				return "БАШНИ";
			}
			if (map_id == 534)
			{
				return "ЛАГЕРЬ";
			}
			if (map_id == 535)
			{
				return "АССАУЛТ";
			}
			if (map_id == 536)
			{
				return "ТЕРМИНАЛ";
			}
			if (map_id == 537)
			{
				return "ХИМЛАБ";
			}
			if (map_id == 538)
			{
				return "МЕТРО";
			}
			if (map_id == 539)
			{
				return "ОКОПЫ";
			}
			if (map_id == 540)
			{
				return "РУИНЫ";
			}
			if (map_id == 541)
			{
				return "КАНАЛИЗАЦИЯ";
			}
			if (map_id == 542)
			{
				return "ЛЮКСВИЛЬ";
			}
			if (map_id == 543)
			{
				return "ВОКЗАЛ";
			}
			if (map_id == 544)
			{
				return "ИТАЛИЯ";
			}
			if (map_id == 545)
			{
				return "ТУРНИРНАЯ КОНТРА";
			}
			if (map_id == 546)
			{
				return "ПОДЗЕМКА1337";
			}
			if (map_id == 547)
			{
				return "АНГАР";
			}
			if (map_id == 548)
			{
				return "2013";
			}
			if (map_id == 549)
			{
				return "БЕРЛИН";
			}
			if (map_id == 550)
			{
				return "РАЗВАЛИНЫ";
			}
			if (map_id == 551)
			{
				return "ГРАНЬ";
			}
			if (map_id == 552)
			{
				return "КЭШ";
			}
			if (map_id == 553)
			{
				return "АРЕНА";
			}
			if (map_id == 554)
			{
				return "ЗАКОУЛОК";
			}
			if (map_id == 555)
			{
				return "РУИНЫ 2017";
			}
			if (map_id == 556)
			{
				return "ШТОРМ";
			}
			if (map_id == 557)
			{
				return "АДРЕНАЛИН";
			}
			if (map_id == 558)
			{
				return "ЗИМНЯЯ ФАБРИКА";
			}
			if (map_id == 559)
			{
				return "ЗИМНИЙ АССАУЛТ";
			}
			if (map_id == 560)
			{
				return "ЗИМНИЙ МЕНШЕН";
			}
			if (map_id == 561)
			{
				return "ЗИМНИЙ ДАСТ1";
			}
			if (map_id == 562)
			{
				return "СТАРЫЙ ОФИС";
			}
			if (map_id == 563)
			{
				return "ТУСКАН МИНИ";
			}
			if (map_id == 564)
			{
				return "АРЕНА МАЙЯ";
			}
			if (map_id == 565)
			{
				return "НОВЫЙ ДАСТ";
			}
			if (map_id == 566)
			{
				return "ЦЕПЬ";
			}
			if (map_id == 567)
			{
				return "КАНЬЕН";
			}
			if (map_id == 601)
			{
				return "МИНИДАСТ";
			}
			if (map_id == 602)
			{
				return "БАССЕЙН";
			}
			if (map_id == 603)
			{
				return "ПЕРЕКРЁСТОК";
			}
			if (map_id == 604)
			{
				return "РЕКА";
			}
			if (map_id == 605)
			{
				return "АРЕНА35";
			}
			if (map_id == 606)
			{
				return "АРЕНА50";
			}
			if (map_id == 607)
			{
				return "ХРАНИЛИЩЕ";
			}
			if (map_id == 608)
			{
				return "ИНДИЯ";
			}
			if (map_id == 609)
			{
				return "БЕЗУМИЕ";
			}
			if (map_id == 610)
			{
				return "ЭПИЦЕНТР";
			}
			if (map_id == 611)
			{
				return "РУИНЫ";
			}
			if (map_id == 612)
			{
				return "МИНИАЦТЕК";
			}
			if (map_id == 613)
			{
				return "МАСКА";
			}
			if (map_id == 614)
			{
				return "75ТН";
			}
			if (map_id == 615)
			{
				return "СТАЙЛ";
			}
			if (map_id == 616)
			{
				return "ФУРОР";
			}
			if (map_id == 617)
			{
				return "АРЕНА МАЙЯ";
			}
			if (map_id == 618)
			{
				return "КОРАБЛЬ";
			}
			if (map_id == 619)
			{
				return "ХОЛОД";
			}
			if (map_id == 620)
			{
				return "НАПРЯМИК";
			}
			if (map_id == 621)
			{
				return "РИСК";
			}
			if (map_id == 622)
			{
				return "МИНИ АЦТЕК";
			}
			if (map_id == 623)
			{
				return "ДИКИЙ ЗАПАД";
			}
			if (map_id == 624)
			{
				return "ВОКЗАЛ";
			}
			if (map_id == 625)
			{
				return "ПЕТЛЯ";
			}
			if (map_id == 626)
			{
				return "МЭНШЕН";
			}
			if (map_id == 627)
			{
				return "АНГАР2";
			}
			if (map_id == 628)
			{
				return "КОСМО";
			}
			if (map_id == 629)
			{
				return "МОНОХРОМ";
			}
			if (map_id == 630)
			{
				return "ОПИСТИОН";
			}
			if (map_id == 631)
			{
				return "НЕЙФЕРНО";
			}
			if (map_id == 632)
			{
				return "ЗИГЗАГ";
			}
			if (map_id == 801)
			{
				return "ОКОПЫ";
			}
			if (map_id == 802)
			{
				return "ОКРУЖЕНИЕ";
			}
			if (map_id == 803)
			{
				return "РУИНЫ";
			}
			if (map_id == 804)
			{
				return "НАСТУПЛЕНИЕ";
			}
			if (map_id == 805)
			{
				return "РЕЙХСТАГ";
			}
			if (map_id == 901)
			{
				return "ПРОРЫВ";
			}
			if (map_id == 701)
			{
				return "ПЛЯЖ";
			}
			if (map_id == 702)
			{
				return "ЗАМОК";
			}
			if (map_id == 703)
			{
				return "ОБОРОНА";
			}
			if (map_id == 704)
			{
				return "ГОРОД АМБРЕЛЛА";
			}
			if (map_id == 705)
			{
				return "ДЕРЕВНЯ";
			}
			if (map_id == 706)
			{
				return "ФОРТ";
			}
			if (map_id == 707)
			{
				return "ЗАБРОШЕННЫЙ ГОРОД";
			}
			if (map_id == 708)
			{
				return "НА БАЛУ";
			}
			if (map_id == 709)
			{
				return "ОБОРОНА";
			}
			if (map_id == 710)
			{
				return "АМБРЕЛЛА";
			}
			if (map_id == 711)
			{
				return "МАГИСТРАЛЬ";
			}
			if (map_id == 712)
			{
				return "ВЫЖИВАНИЕ";
			}
			if (map_id == 713)
			{
				return "КОШМАРНАЯ НОЧЬ";
			}
			if (map_id == 714)
			{
				return "ШАПИТО";
			}
			if (map_id == 715)
			{
				return "ГИБЛЫЙ ХУТОР";
			}
			if (map_id == 716)
			{
				return "СЕЛЕНИЕ";
			}
			if (map_id == 717)
			{
				return "НАШЕСТВИЕ";
			}
			if (map_id == 1101)
			{
				return "ЗИМНИЙ ГОРОД";
			}
			if (map_id == 1102)
			{
				return "ДОЛИНА";
			}
			if (map_id == 1103)
			{
				return "ЗИМНЯЯ ДОЛИНА";
			}
			if (map_id == 1104)
			{
				return "РИВЕРТАУН";
			}
			if (map_id == 1105)
			{
				return "СНОУТАУН";
			}
			if (map_id == 1106)
			{
				return "ПРОТИВОСТОЯНИЕ";
			}
			if (map_id == 301)
			{
				return "ДЕРЕВНЯ-Z 2";
			}
			if (map_id == 302)
			{
				return "ДОМ";
			}
			if (map_id == 303)
			{
				return "ЛАБИРИНТ";
			}
			if (map_id == 304)
			{
				return "МЕЛЬНИЦА";
			}
			if (map_id == 305)
			{
				return "РАКЕТА";
			}
			if (map_id == 306)
			{
				return "КИНДОМ";
			}
			if (map_id == 307)
			{
				return "ГОСПИТАЛЬ";
			}
			if (map_id == 308)
			{
				return "МИРНЫЙ АТОМ";
			}
			if (map_id == 309)
			{
				return "КАНАЛИЗАЦИЯ-Z";
			}
			if (map_id == 310)
			{
				return "ЛОВУШКА";
			}
			if (map_id == 311)
			{
				return "СТАРЫЙ БУНКЕР";
			}
			if (map_id == 312)
			{
				return "СТАРЫЙ ДОМ";
			}
			if (map_id == 313)
			{
				return "СТАРЫЙ ЛАБИРИНТ";
			}
			if (map_id == 314)
			{
				return "СТАРАЯ МЕЛЬНИЦА";
			}
			if (map_id == 315)
			{
				return "СТАРАЯ ДЕРЕВНЯ-Z";
			}
			if (map_id == 316)
			{
				return "СТАРАЯ РАКЕТА";
			}
			if (map_id == 317)
			{
				return "БУНКЕР";
			}
			if (map_id == 1301)
			{
				return "ДАСТ2";
			}
			if (map_id == 1302)
			{
				return "ИНФЕРНО";
			}
			if (map_id == 1303)
			{
				return "ТРЕЙН";
			}
			if (map_id == 1304)
			{
				return "НЮК";
			}
			if (map_id == 1305)
			{
				return "ОФИС";
			}
			if (map_id == 1306)
			{
				return "КЛАНМИЛЛ";
			}
			if (map_id == 1307)
			{
				return "ДАСТ1";
			}
			if (map_id == 1308)
			{
				return "ФЛАЙ2";
			}
			if (map_id == 1309)
			{
				return "КОБЛ";
			}
			if (map_id == 1310)
			{
				return "ШТОРМ";
			}
			return "КАРТА#" + map_id.ToString();
		}
	}

	// Token: 0x0400016B RID: 363
	public static int current = 0;

	// Token: 0x0400016C RID: 364
	private static string[][] txt = new string[2][];
}
